{"known_rules":[{"title":"Vacations & Delegation","id":"2689","text":"Delegate is an Office switch with possible values of \"None\" and\nany active player, and default value of \"None\". Delegates are\ntracked by the ADoP in eir weekly report.\n\nA player CAN flip the Delegate switch of a specified office to\nemself with Agoran Consent. If the Delegate switch of an office is\nset to \"None\", the holder of that office CAN flip the Delegate\nswitch of that office to a specified player with support from that\nspecified player.\n\nAn officer CAN and SHOULD take a Vacation from a specified office\ne has continuously held for over 6 months with 7 day notice, if e\nhas not done so in the past year. When an officer qualifies for a\nVacation, the ADoP SHOULD encourage em to take one, at least once\na quarter.\n\nAn officer is On Vacation from a specified office if e has taken a\nVacation from that office in the past 30 days. The list of\nofficers currently on vacation is part of the ADoP's report.\n\nWhile the holder of an office is On Vacation, the Delegate of that\noffice CAN perform an action ordinarily reserved for the\noffice-holder as if e held the office, if it would be POSSIBLE for\nthe Delegate to perform the action, other than by this method, if\ne held the office.\n\nRules to the contrary notwithstanding, while an officer is On\nVacation that officer NEED NOT comply with any duties of that\noffice, and the Delegate, if any, SHALL comply with all duties of\nthe office as if e held the office.\n\nThe Delegate of an office CANNOT resign it. The Delegate of an\noffice, if any, and the holder of that office, if any, CAN by\nannouncement flip the Delegate of that office to \"None\".\n","power":3.0},{"title":"The Land Managor","id":"2706","text":"The Land Managor is an office.\n\nThe Land Managor's report includes a list of types of Crops and\ntheir attributes, and a list of Crops planted and harvested during\nthe current Crop Season.\n","power":1.0},{"title":"Impeachment","id":"2573","text":"Any player CAN, with 2 Agoran consent, expel (impeach) the holder\nof a specified voluntary office. When a person is impeached from\nan office, the selection method for that office is immediately\ninitiated (if possible). Players SHOULD NOT use this method of\nremoval unless the officer has abused the powers of eir office or\notherwise shown emself unworthy of the trust of Agora.\n","power":2},{"title":"Definition and Continuity of Entities","id":"1586","text":"If multiple rules attempt to define an entity with the same name,\nthen they refer to the same entity. A rule-defined entity's name\nCANNOT be changed to be the same as another rule-defined entity's\nname.\n\nA rule, contract, or regulation that refers to an entity by name\nrefers to the entity that had that name when the rule first came\nto include that reference, even if the entity's name has since\nchanged.\n\nIf the entity that defines another entity is amended such that it\nno longer defines the second entity, then the second entity and\nits attributes cease to exist.\n\nIf the entity that defines another entity is amended such that it\ndefines the second entity both before and after the amendment, but\nwith different attributes, then the second entity and its\nattributes continue to exist to whatever extent is possible under\nthe new definitions.\n","power":2},{"title":"Agora Is A Nomic","id":"1698","text":"Agora is ossified if it is IMPOSSIBLE for any reasonable\ncombination of actions by players to cause arbitrary rule changes\nto be made and/or arbitrary proposals to be adopted within a\nreal-world (UTC) four-week period.\n\nIf, but for this rule, the net effect of a proposal would cause\nAgora to become ossified, or would cause Agora to cease to exist,\nit cannot take effect, rules to the contrary notwithstanding. If\nany other single change or inseparable group of changes to the\ngamestate would cause Agora to become ossified, or would cause\nAgora to cease to exist, it is cancelled and does not occur, rules\nto the contrary notwithstanding.\n","power":4},{"title":"The Webmastor","id":"2616","text":"The Webmastor is a sortitioned office.\n\nThe Webmastor's monthly report includes a Directory, a Changelog,\na Warning Log, and an Error Log. The Directory lists notable\ncurrently maintained public resources. The Changelog lists notable\nchanges to resources. The Warning Log lists notable potential\nissues, such as inaccurate or aging resources or unintended issues\nwith a public resource. The Error Log lists notable losses of\nresources - where a resource has become inaccessible,\nunmaintained, or unusable. Where 'notable' is used in this rule\nits meaning is up to the Webmastor's discretion.\n","power":1.0},{"title":"Calls for Judgement","id":"991","text":"Any person (the initiator) can initiate a Call for Judgement (CFJ,\nsyn. Judicial Case), specifying a statement to be inquired into by\nannouncement. A case so initiated is an inquiry case.\n\nWhen a person initiates a Call for Judgement, e CAN optionally bar\none person from the case by announcement.\n\nAt any time, each CFJ is either open (default), suspended, or\nassigned exactly one judgement that was validly assigned.\n\nThe Arbitor is an office, responsible for the administration of\njustice in a manner that is fair for emself, if not for the rest\nof Agora.\n\nJudge is an untracked CFJ switch with possible values of any\nperson or former person, or \"unassigned\" (default). To \"assign\" a\nCFJ to a person is to flip that CFJ's judge to that person.  To\n\"remove\" or \"recuse\" a person from a being the judge of a CFJ is\nto flip that CFJ's judge from that person to unassigned.\n\nWhen an open CFJ's judge is unassigned, the Arbitor CAN assign any\neligible player to be its judge by announcement, and SHALL do so\nin a timely fashion after it becomes an open and unassigned CFJ.\nIn the same message in which e does so, e SHALL also (and CAN by\nannouncement or by clear specification) assign it an ID number,\nunless it already has one. The players eligible to be assigned as\njudge are all active players except the initiator and the person\nbarred (if any). The Arbitor SHALL assign judges over time such\nthat all interested players have reasonably equal opportunities to\njudge. If a CFJ has no judge assigned, then any player eligible to\njudge that CFJ CAN assign it to emself without 3 objections.\n\nThe Arbitor's weekly report includes a summary of recent judicial\ncase activity, including open and recently-judged cases, recent\njudicial assignments, and a list of players interested in judging.\n\nIf two CFJs become assigned to the same judge in the same message,\nthose CFJs are \"linked\" to each other, unless that message\nspecifies that the CFJs should not be linked. The Arbitor SHOULD\nconsider linking two CFJs if they inquire about the same or\nsubstantially similar events and are called at approximately the\nsame time.\n","power":2},{"title":"The Birthday Tournament","id":"2495","text":"In a timely fashion after the start of June 1 of each year, the\nHerald SHALL propose a set of Regulations governing a Birthday\nTournament for that year; the Herald CAN also delegate the\nresponsibility for creating or running the tournament to another\nplayer, with that player's consent, by announcement.\n\nThe Birthday Tournament's regulations SHOULD be such that all\npersons who choose to participate have a fair chance of winning\nthe tournament (according to its regulations), and a winner\nSHOULD be expected within 2-3 weeks following the tournament's\ninitiation.\n\nAfter adequate time for discussion of the Birthday Tournament's\nregulations, the Herald (or delegate) CAN initiate a sanctioned\ntournament, specifying a finalized set of governing regulations,\nwithout 3 objections. These regulations may thereafter be amended\nonly by the Herald or eir designee Without 3 Objections. The\ninitiation SHOULD be timed to coincide with Agora's Birthday.\n","power":1},{"title":"Motion of No Confidence","id":"2463","text":"Any player CAN, with Agoran consent, cause the office of Prime\nMinister to become vacant, provided that the message in which e\ndoes so contains the string \"MOTION OF NO CONFIDENCE\" in its\nsubject line. Motions of no confidence SHOULD be used whenever\nAgorans want to shake things up, rather than as a personal\njudgement of the Prime Minister.\n","power":2},{"title":"Resolving Agoran Decisions","id":"208","text":"The vote collector for an unresolved Agoran decision CAN resolve\nit by announcement, indicating the outcome. If it was required to\nbe initiated, then e SHALL resolve it in a timely fashion after\nthe end of the voting period. To be EFFECTIVE, such an attempt\nmust satisfy the following conditions:\n\n1. It is published after the voting period has ended.\n\n2. It clearly identifies the matter to be resolved.\n\n3. It specifies the number of voters (or a list of the voters).\n   For these purposes and for determining quorum, a \"voter\" is\n   someone who submitted a ballot on the decision that was valid\n   when it was submitted and also valid (i.e. not withdrawn or\n   otherwise invalidated) at the end of the voting period.\n\n4. It specifies the outcome, as described elsewhere, and, if there\n   was more than one valid option, provides a tally of the voters'\n   valid ballots.\n\nEach Agoran decision has exactly one vote collector, defaulting to\nthe initiator of the decision. If the vote collector is defined by\nreference to a position (or, in the default case, if the initiator\nwas so defined), then the vote collector is the current holder of\nthat position.\n\nThis rule takes precedence over any rule that would provide\nanother mechanism by which an Agoran decision may be resolved.\n\nIn general, changes to the gamestate due to the outcome of an\nAgoran decision take effect when the decision is resolved.\n","power":3},{"title":"Scoring Numbers","id":"2713","text":"Whenever an inquiry case with an ID number is assigned a\njudgement, if it had never previously been assigned a judgement,\nits judge scores its ID number, unless its initiator had initiated\n4 or more other CFJs earlier in the same week that it was\ninitiated.\n\nWhenever a distributed proposal is adopted, its author scores its\nID number, unless its author had submitted 8 or more proposals\nearlier in the same week that it was submitted.\n\nWhenever a player scores a number as described in this rule, the\nNumerator CAN once, and SHALL in a timely manner, grant that\nplayer (and, if the number was scored due to the adoption of a\nproposal, also a randomly chosen other player who voted FOR on a\nreferendum to adopt that proposal) a number card for each digit in\nthat number, whose type is that digit.\n\nOfficers SHALL NOT assign ID numbers to distributed proposals or\nCFJs that are out of sequence, but are given reasonable discretion\nto determine what \"in sequence\" means (e.g. officers may choose\nwhether to include or exclude in the numbering sequence entities\nwhose proposal or CFJ status is disputed or unclear). ID numbers\nthat are more than 5 digits long cannot be scored (this is an\nexception to the other paragraphs of this rule and takes\nprecedence over them).\n","power":1.0},{"title":"Pledges","id":"2450","text":"If a consenting Player makes a clear public pledge (syn. Oath) to\nperform (or refrain from performing) certain actions, then\nbreaking the pledge is ILLEGAL; doing so is the Class N infraction\nof Oathbreaking, where N is the value explicitly stated by the\npledge, or 2 if the pledge does not explicitly state a value.\nAllowing a pledge to expire without carrying out an action one\npledged to do in it constitutes breaking the pledge. If it would\notherwise be indeterminate whether a player has violated a pledge,\nthen e shall be deemed to have violated that pledge.\n\nThe time window of a pledge is W days, where W is the value\nexplicitly stated by the pledge, or 60 if the pledge does not\nexplicitly state a value. A pledge ceases to exist at the end of\nits time window.\n\nIf breaking the pledge harms specific other parties, the Referee\nSHOULD solicit the opinion of those parties in determining an\nappropriate fine.\n\nThe Notary CAN destroy a pledge Without Objection, but SHOULD NOT\ndo so unless the pledge no longer serves any significant purpose.\n","power":1.7},{"title":"Welcome Packages","id":"2499","text":"When a player receives a welcome package, if e has not received a\nwelcome package, including under any previous definition, since e\nlast registered nor in the past 30 days, e gains the following\nassets:\n\n* 15 spendies, if e has not been granted any spendies since e last\n  registered.\n* 16 Hectares.\n\nA player CAN, by announcement, cause a specified player to receive\na welcome package (syn. \"grant\" em a welcome package).\n","power":1},{"title":"Hats","id":"2694","text":"Hats are a secured player switch defaulting to \"none\" with the\nfollowing possible values and associated meanings for the player's\ncurrent focus:\n\n  none: no particular focus\n\n  armored helm: competing for wins and in sub-games\n\n  dunce cap: expressing regret or acknowledging a mistake\n\n  floral wreath: resolving conflict\n\n  green eyeshade: maintaining accurate records\n\n  hard hat: repairing problems in the rules\n\n  jaunty beret: exploring creative expression\n\n  jester's cap: bringing levity and humor\n\n  judicial wig: ruling on CFJs and interpreting the rules\n\n  knitted cap: finding loopholes and exploits\n\n  plain hat: simplifying the rules\n\n  rugged fedora: researching Agoran and Nomic history\n\n  sleeping cap: reducing eir participation in Agora\n\n  steampunk hat: creating new game mechanics\n\n  traditional mortarboard: conducting research and writing theses\n\nA player CAN change eir hat at any time by notifying the\nrecordkeepor for eir hat (publicly or privately). The recordkeepor\nfor a player's hat is the player emself. Rules to the contrary\nnotwithstanding, reporting on one's own hat is OPTIONAL.\n\nHats do not otherwise limit or restrict a player's actions in any\nway, and every player is ENCOURAGED to participate in all aspects\nof the game regardless of eir current hat.\n","power":1.0},{"title":"Initiating Agoran Decisions","id":"107","text":"An Agoran decision is initiated when a person authorized to\ninitiate it publishes a valid notice which sets forth the intent\nto initiate the decision. To be valid, the notice must clearly\nspecify the following information:\n\n1. The matter to be decided (for example, \"the adoption of\n   proposal 4781\");\n\n2. The voting method;\n\n3. A clear description of the valid options;\n\n4. The identity of the vote collector; and\n\n5. Any additional information defined by the rules as essential\n   parameters.\n\nThe initiation of an Agoran decision also initiates the voting\nperiod for that decision. The default length of the voting period\nis 7 days. Changing the length of a decision's voting period is\nsecured at power 2, and it CANNOT be set or changed to more than\n14 days, or less than 5 days for a decision with at least two\noptions.\n\nThe vote collector for a decision with less than two options CAN\nend the voting period by announcement, if it has not ended\nalready, and provided that e resolves the decision in the same\nmessage.\n\nA public notice purporting to initiate an Agoran decision is a\nself-ratifying attestation that the notice was valid, that the\nperson (if any) publishing the notice was authorized to initiate\nthe decision, that such a decision was initiated, and that that\ndecision's voting period was initiated\n\nThe destruction of Agoran decisions is secured. An Agoran\ndecision's matter to be decided, voting method, valid options, and\nvote collector are secured at the power of the Rule authorizing\nthe initiation of such a decision.\n","power":3},{"title":"First Speaker","id":"104","text":"The Speaker for the first game shall be Michael Norrish.\n","power":3},{"title":"Stamp Scamp","id":"2701","text":"A rare stamp is a stamp that is the only one of its type that\nexists.\n\nStamp scamp is a singleton switch tracked by the Collector with\npossible values of each player and null (default). Upon a correct\nannouncement that a specified player owns more rare stamps than\nany other player, the stamp scamp switch is flipped to that\nplayer.\n\nIf no person has done so by this mechanism in this quarter, the\nvalue of the stamp scamp switch, if a player, CAN by announcement\ncause another specified player to gain one stamp of that player's\ntype.\n","power":1.0},{"title":"Fungibility","id":"2578","text":"Any two assets within a \"fungible\" class of assets (syn.\n\"currency\") that have the same owner are considered equivalent for\nthe purposes of specification, granting, and transferring. The\nnumber of such assets an entity owns is that entity's \"balance\" of\nthat currency.\n","power":3},{"title":"Precedence between Rules","id":"1030","text":"In a conflict between Rules, the conflict shall be resolved by\nperforming the following comparisons in the sequence written in\nthis rule, until the conflict is resolved.\n\n- In a conflict between Rules with different Power, the Rule with\n  the higher Power takes precedence over the Rule with the lower\n  Power; otherwise,\n\n- If all of the Rules in conflict explicitly say that their\n  precedence relations are determined by some other Rule for\n  determining precedence relations, then the determinations of the\n  precedence-determining Rule shall be used to resolve the\n  conflicts; otherwise,\n\n- If at least one of the Rules in conflict explicitly says of\n  itself that it defers to another Rule (or type of Rule) or takes\n  precedence over another Rule (or type of Rule), then such\n  provisions shall be used to resolve the conflict, unless they\n  lead to contradictions between each other; otherwise,\n\n- If any of the rules in conflict have ID numbers, then the Rule\n  with the lowest ID number takes precedence; otherwise,\n\n- The Rule enacted earliest takes precedence.\n\nClauses in any other rule that broadly claim precedence (e.g. over\n\"all rules\" of a certain class) shall be, prima facie, considered\nto be limited claims of precedence or deference that are\napplicable only when such claims are evaluated as described within\nthe above sequence.\n\nNo change to the ruleset can occur that would cause a Rule to\ndirectly claim precedence over this Rule as a means of determining\nprecedence. This applies to changes by the enactment or amendment\nof a Rule, or of any other form. This Rule takes precedence over\nany Rule that would permit such a change to the ruleset.\n","power":3.3},{"title":"The Veblen","id":"2695","text":"The Veblen is a unique indestructible fixed asset tracked by the\nAbsurdor, with ownership entirely restricted to players and Agora.\nIf the Veblen would otherwise be in abeyance, or if it is owned by\nthe Lost and Found Department, it is immediately transferred to\nAgora.\n\nThe Veblen cost is a secured singleton positive integer switch\ntracked by the Absurdor and with default value one.\n\nA player CAN pay a fee of X spendies, where X is an integer not\nless than the current Veblen cost, to set the Veblen cost to X+1.\nWhen e does so, if e does not own the Veblen, the Veblen is\ntransferred to em.\n\nIf the Veblen has not been transferred or devalued within the past\nmonth, then a player CAN devalue the Veblen by announcement, thus\nsetting the Veblen cost to half its current value (rounded up).\n\nThe owner of the Veblen SHOULD conspicuously show off eir\nownership of it from time to time.\n\nIf the Veblen does not exist and no one has Created Something E\nCannot Destroy in the past week, any player CAN, by announcement,\nCreate Something E Cannot Destroy. When e does so, e wins the\ngame, and the Veblen is created in eir possession. A player who\nwins in this fashion SHOULD submit a proposal to prevent the\ndestruction from arising again.\n","power":0.5},{"title":"Conditional Votes","id":"2127","text":"A conditional vote on an Agoran decision is a vote which indicates\na vote based on some condition(s). A conditional vote is evaluated\nat the end of the voting period and, rules to the contrary\nnotwithstanding, is clearly specified if and only if the value of\nthe condition(s) is/are determinate at the end of the voting\nperiod. If the conditional is clearly specified, and evaluates to\na valid vote, it is counted as that vote; otherwise, it is counted\nas PRESENT.\n\nAny vote which is clearly expressed as a conditional, e.g. \"FOR if\n<X> is true, AGAINST otherwise\", is a valid conditional vote that\nevaluates as specified.\n\nA vote endorsing another person is equivalent to a conditional\nvote evaluating to the vote specified in that person's valid\nballot on the decision, if any.\n\nFor an instant runoff decision, a vote consisting of a list, one\nor more entries of which are valid conditional votes, and the\nremaining entries of which are valid options, is a valid\nconditional vote. Such a vote is evaluated by evaluating each\nconditional entry to a list of votes (or an empty list, if it\nevaluates to PRESENT either directly or indirectly), and then\nconcatenating those lists with the specified valid options in the\norder they occurred in the original vote.\n","power":3},{"title":"Mother, May I?","id":"2152","text":"The following terms are defined. These definitions are used when a\nrule includes a term in all caps, and provide guidance in\ndetermining the ordinary-language meaning of a term when a rule\nincludes a term otherwise. Earlier definitions take precedence\nover later ones. If a rule specifies one or more persons in\nconnection with a term, then the term applies only to the\nspecified person(s).\n\n1. CANNOT, IMPOSSIBLE, INEFFECTIVE, INVALID: Attempts to perform\n   the described action are unsuccessful.\n\n2. MUST NOT, MAY NOT, SHALL NOT, ILLEGAL, PROHIBITED: Performing\n   the described action violates the rule in question.\n\n3. NEED NOT, OPTIONAL: Failing to perform the described action\n   does not violate the rules.\n\n4. SHOULD NOT, DISCOURAGED, DEPRECATED: Before performing the\n   described action, the full implications of performing it ought\n   to be be understood and carefully weighed.\n\n5. CAN, POSSIBLE, EFFECTIVE, VALID: Attempts to perform the\n   described action are successful.\n\n6. MAY, LEGAL, PERMISSIBLE: Performing the described action does\n   not violate the rules.\n\n7. MUST, SHALL, REQUIRED, MANDATORY: Failing to perform the\n   described action violates the rule in question.\n\n8. SHOULD, ENCOURAGED, RECOMMENDED: Before failing to perform the\n   described action, the full implications of failing to perform\n   it ought to be understood and carefully weighed.\n","power":3},{"title":"The Registrar","id":"2139","text":"The Registrar is an office; its holder is responsible for keeping\ntrack of players.\n\nThe Registrar's weekly report includes:\n\n1. A list of all players, including information sufficient to\n   identify and contact each player.\n\n2. The date on which each player most recently became a player.\n\n3. For each forum with non-Foreign publicity, sufficient\n   instructions for players to receive messages there.\n\nThe Registrar's monthly report includes:\n\n1. For each former player for which the information is reasonably\n   available, the dates on which e registered and deregistered.\n","power":2},{"title":"Interpreting the Rules","id":"217","text":"When interpreting and applying the rules, the text of the rules\ntakes precedence. Where the text is silent, inconsistent, or\nunclear, it is to be augmented by game custom, common sense, past\njudgements, and consideration of the best interests of the game.\n\nDefinitions and prescriptions in the rules are only to be applied\nusing direct, forward reasoning; in particular, an absurdity that\ncan be concluded from the assumption that a statement about\nrule-defined concepts is false does not constitute proof that it\nis true. Definitions in lower-powered Rules do not overrule\ncommon-sense interpretations or common definitions of terms in\nhigher-powered rules, but may constructively make reasonable\nclarifications to those definitions. For this purpose, a\nclarification is reasonable if and only if it adds detail without\nchanging the underlying general meaning of the term and without\ncausing the higher powered rule to be read in a way inconsistent\nwith its text.\n\nRules to the contrary notwithstanding, any rule change that would\n(1) prevent a person from initiating a formal process to resolve\nmatters of controversy, in the reasonable expectation that the\ncontroversy will thereby be resolved; or (2) prevent a person from\ncausing formal reconsideration of any judicial determination that\ne should be punished, is wholly void and without effect.\n","power":3},{"title":"Promises","id":"2618","text":"Promises are a class of assets, tracked by the Notary. Their\nessential attributes are their text and creator. A consenting\nplayer CAN, by announcement, grant a specified entity a promise,\nspecifying its text and becoming its creator. A promise's owner is\nreferred to as its bearer. Promises with the same text, creator,\nand bearer are fungible. Promises with the same text and creator\nSHOULD be referred to by the same title, but the title is not an\nessential attribute of the promise, just a way of referring to it.\n\nThe creation of promises is secured. The text of a promise CANNOT\nbe altered after it is created.\n\nA player (the casher) CAN, by announcement, cash a promise,\nprovided that both a) any conditions for cashing it specified by\nits text are unambiguously met, and b) either the casher is the\npromise's bearer, or the promise is owned by the Library. By doing\nso, e acts on the creator of the promise's behalf, causing the\ncreator to act as if e published the promise's text, and destroys\nthe promise.  However, to limit recursion, no promise can be\ncashed during the execution of another promise unless it existed\nbefore the execution of that promise began. The bearer SHOULD\nrecite the promise's essential attributes in the same message e\ncashes it.\n\nIn a promise's text, \"the bearer\" and \"the casher\" (or the like)\nboth refer to the player who cashed the promise, and \"this\npromise\" (or the like) refers to the promise. The text of the\npromise can refer to the context of the message in which it is\ncashed, but the context of the message does not otherwise change\nthe meaning of the promise.\n\nThe Library is an entity and CAN own promises.\n\nThe creator of a promise CAN take or revoke it from the Library by\nannouncement, unless the promise's text unambiguously designates\nit as irrevocable. Any player CAN revoke a specified promise from\nthe Library without objection. If a promise specifies expiration\nconditions then any player CAN by announcement destroy it while\nthe expiration conditions are unambiguously met.\n","power":2.2},{"title":"Agoran Bingo","id":"2702","text":"The Collar is an elected office responsible for administering\nAgoran Bingo.\n\nBingo state is a singleton switch tracked by the Collar with\npossible values paused (default) and unpaused.\n\nIf the bingo state is paused, the Collar CAN flip it to unpaused\nby announcement, and e SHOULD do so unless there is reasonable\nuncertainty as to the current bingo state or the validity of a\nclaimed bingo, or the Collar is actively drafting, discussing, or\ntrying to enact or amend eir administrative regulations. When the\nbingo state is paused, all existing bingo board selections are\nnull and void, a player CANNOT select a bingo board, and a player\nCANNOT call bingo.\n\nIf the bingo state is unpaused, a player whose bingo board\ncontains at least one winning pattern of conditions -- as defined\nin the Collar's regulations -- that are all satisfied CAN call\nbingo by announcement. (For clarity, the states of any conditions\nnot in the winning pattern are irrelevant.) Eir announcement:\n\n1) MUST specify the claimed winning pattern and the conditions it\n   contains;\n\n2) MUST reveal any information required by the Collar's\n   adminstrative regulations for the method e used to select a\n   bingo board; and\n\n3) SHOULD include evidence demonstrating that each of the\n  conditions in the winning pattern is satisfied, other than any\n  conditions where such satisfaction is already clearly obvious.\n\nWhen a player successfully calls bingo, e wins the game and the\nbingo state is flipped to paused.\n\nIf no player has successfully called bingo in the previous 3\nmonths, the Collar can flip the bingo state to paused without 2\nobjections.\n","power":1.0},{"title":"Voting Methods","id":"2528","text":"Each Agoran decision has a voting method, which must be\nAI-majority, instant runoff, or first-past-the-post. The voting\nmethod is that specified by the authorizing authority, or\nfirst-past-the-post by default.\n\nEach Agoran decision has a set of valid options (the choices that\nthe voters are being asked to select from) and valid votes (the\nways in which the voters can express their opinion or lack\nthereof). For AI-majority decisions, the valid options are FOR and\nAGAINST; for other decisions, the valid options are defined by\nother rules.\n\nThe valid votes on an Agoran decision are:\n\n1. PRESENT;\n\n2. The valid conditional votes, as defined by rules of power at\n   least that of this rule; and\n\n3. For an instant runoff decision, the ordered lists of entities.\n\n4. For any other decision, the valid options.\n","power":3},{"title":"Acting on Commitment","id":"2681","text":"A Fingerprint for a document (the Plaintext) is a document that\ncould not have been reasonably created without knowledge of the\nPlaintext, and which is related to the Plaintext in such a way\nthat one could not reasonably produce another document related to\nthat Fingerprint in the same way.\n\nA person CAN make a commitment to a particular kind of document by\npublishing a statement that purports to be a Fingerprint for a\ndocument of that kind. If the statement is in fact such a\nFingerprint, the person CAN then reveal the commitment by\npublishing the Plaintext corresponding to that Fingerprint and\nclearly indicating which Fingerprint the Plaintext relates to.\n\nA person making a commitment SHOULD specify the method used to\nproduce the Fingerprint from the Plaintext.\n","power":1},{"title":"The Growth Cycle","id":"2709","text":"A player CAN plant an in-season Crop by paying a fee in Pyrite\nequal to its Seed Cost, provided that eir number of Hectares is\ngreater than the number of Crops e planted earlier in the current\nCrop Season and has not yet harvested.\n\nOnce per Crop that a player planted earlier in the current Crop\nSeason and at least <Growth Duration> days ago, e CAN harvest it\nby announcement, gaining Pyrite equal to its Sell Price\n(exception: if the Weather for the week e planted it had already\nbeen selected at the time e planted it, e CANNOT harvest it before\nthe end of the week after the week e planted it).\n\nWhen the Fields Wither, all unharvested Crops are lost. For the\navoidance of doubt, the previous paragraph notwithstanding, a\nplayer CANNOT harvest a Crop planted before the most recent time\nthe Fields Withered.\n\nOnce each week, the Land Managor SHALL randomly select and\nannounce the Weather for that week, which is either Good\n(probability 30%), Neutral (probability 60%), or Bad (probability\n10%). At the end of each week in which Bad Weather was selected\nthis way, all unharvested Crops are lost.\n\nAt the end of each Crop Season, the Fields Wither.\n","power":1.0},{"title":"Number Cards","id":"2712","text":"Number cards are a type of asset. Ownership of number cards is\nrestricted to players and contracts. Each number card has a type,\nwhich is a decimal digit in the range 0 to 9 inclusive. Number\ncards with the same type are fungible.\n\nThe Numerator is an office, and the recordkeepor of number cards.\n","power":1.0},{"title":"Spending Number Cards","id":"2714","text":"A player CAN, once per week, pay ten number cards, where each of\nthose number cards is of a different type, to gain 25 radiance.\n\nFor any two decimal digits X and Y (which may be the same), a\nplayer CAN pay 2 spendies, a number card of type X, and a number\ncard of type Y to grant emself a number card whose type is the\nlast digit of the sum X+Y.\n","power":1.0},{"title":"Blots","id":"2555","text":"Blots are an indestructible fixed currency with ownership\nrestricted to persons. A person with 1 or more blots is Impure, a\nperson with 0 blots is Pure. An impure unregistered person is a\nFugitive. The Referee is an office, and the recordkeepor for\nblots.\n\nTo expunge a blot is to destroy it. Creating and destroying blots\nis secured with a Power Threshold of 1.7\n\nA person CAN, by announcement, create a specified number of blots\nin eir possession.\n\nAny player CAN pay a fee of 7 Spendies to revoke a blot from a\nspecified person.\n\nOnce per quarter, the Referee CAN by announcement (and SHALL\nduring its first Eastman week) issue a Notice of Clemency, upon\nwhich half (rounded down) of each fugitive's blots are destroyed.\n","power":2},{"title":"The Notary","id":"2608","text":"The Notary is an office.\n\nThe Notary's monthly report contains:\n\n1. every pledge, along with its title, creator, time window, time\n   of creation, and time of expiry;\n2. every contract, with its title, full provisions, and parties;\n   and\n3. every promise, along with its title, text, creator, and bearer.\n\nIf the Notary is required to report an entity's title, but none\nhas been otherwise publicly provided, e CAN assign one by public\ndesignation.\n","power":2.0},{"title":"Power Controls Mutability","id":"2140","text":"Rules to the contrary notwithstanding, no entity with power below\nthe power of this rule can\n\n1. cause an entity to have power greater than its own.\n\n2. adjust the power of an instrument with power greater than its\nown.\n\n3. set or modify any other substantive aspect of an instrument\nwith power greater than its own (that is, one that affects the\ninstrument's operation).\n","power":3},{"title":"Read the Ruleset Week","id":"2327","text":"The first Agoran week each year which falls entirely in February\nis Read the Ruleset Week. Agorans are encouraged to read the\nruleset during Read the Ruleset Week.\n","power":1},{"title":"Ownership","id":"2576","text":"Each asset has exactly one owner.\n\nAn asset CANNOT be gained by or transferred to an entity unless\nits backing document specifies that entity can own it. If an\nasset's backing document is otherwise silent on which entities can\nown it, then it can be owned by Agora, players, and contracts.\n\nAn asset \"in abeyance\" is one whose owner is nonexistent,\nindeterminate, or invalid. If an asset would otherwise be in\nabeyance, then it is owned by the Lost and Found Department (if\npossible) or destroyed (otherwise), subject to modification by its\nbacking document (provided that the modification either destroys\nit or prevents it from being in abeyance). Rules to the contrary\nnotwithstanding, the Lost and Found Department can own assets of\nevery type. Assets owned by the Lost and Found Department can be\ntransferred or destroyed by any player without objection.\n","power":3},{"title":"Role and Attributes of Rules","id":"2141","text":"A rule is a type of instrument that is always taking effect and\nhas the capacity to govern the game generally. A rule's content\ntakes the form of a text, and is unlimited in scope. The ruleset\nis the set of all currently-existing rules.\n\nEvery current rule has power between 0.1 and 4.0 inclusive.\n\nEvery rule shall have an ID number, distinct among current and\nformer rules, to be assigned once by the Rulekeepor by public\ndesignation.\n\nEvery rule shall have a title to aid in identification. If a rule\never does not have a title, then the Rulekeepor CAN and SHALL\nassign a title to it by announcement in a timely fashion.\n\nFor the purposes of rules governing modification of instruments,\nthe text, power, ID number, and title of a rule are all\nsubstantive aspects of the rule. However, rules to the contrary\nnotwithstanding, the Rulekeepor CAN set rule aspects as described\nelsewhere in this rule.\n","power":3.2},{"title":"Assets","id":"2166","text":"An asset is an entity defined as such by a document that has been\ngranted Mint Authority by the Rules (hereafter the asset's backing\ndocument), and existing solely because its backing document\ndefines its existence. An asset's backing document can generally\nspecify when and how that asset is created, destroyed, and\ntransferred.\n\nThe rules collectively have Mint Authority. Contracts have Mint\nAuthority. An asset defined by rule or regulation is public; any\nother asset is private.\n","power":3},{"title":"Etiquette","id":"2677","text":"Officers SHOULD:\n\n - publish dates in YYYY-MM-DD or DD Mon YY format in reports,\n   whichever is more fitting to the situation;\n\n - communicate a schedule of when regularly timed duties will\n   usually be done;\n\n - maintain an online version of eir report(s) in a browser-native\n   format (such as HTML); AND\n\n - maintain a repository of eir report(s) in a public place.\n\nPlayers SHOULD:\n\n - signal the official name of the primary action and/or the\n   relevant officer that tracks said actions in the title of a\n   public message; AND\n\n - be kind.\n","power":0.5},{"title":"Proposals","id":"2350","text":"A proposal is a type of entity consisting of a body of text and\nother attributes. A player CAN create (syn. submit) a proposal by\nannouncement, specifying its text and optionally specifying any of\nthe following attributes:\n\n* An associated title.\n\n* A list of coauthors (which must be persons other than the\n  author).\n\n* An adoption index.\n\nCreating a proposal adds it to the Proposal Pool. Once a proposal\nis created, its text, author, and AI cannot be changed. The author\n(syn. proposer) of a proposal is the person who created it.\n\nThe author of a proposal in the Proposal Pool CAN remove (syn.\nretract, withdraw) it from the Pool by announcement.\n\nThe destruction of a proposal is secured. The removal of a\nproposal from the Proposal Pool, other than by distribution, is\nsecured.\n","power":3},{"title":"Contests","id":"2699","text":"Contestation is a secured negative boolean contract switch tracked\nby the Notary. A contract whose contestation switch is true is a\ncontest.\n\nA player CAN flip a specified contract's contestation to true\nwithout 2 objections.\n\nA player CAN flip a specified contract's contestation to false\nwith Agoran consent.\n","power":1.5},{"title":"Regulated Actions","id":"2125","text":"An action is regulated if: (1) the Rules limit, allow, enable, or\npermit its performance; (2) the Rules describe the circumstances\nunder which the action would succeed or fail; or (3) the action\nwould, as part of its effect, modify information for which some\nplayer is required to be a recordkeepor.\n\nA Regulated Action CAN only be performed as described by the\nRules, and only using the methods explicitly specified in the\nRules for performing the given action. The Rules are not to be\ninterpreted so as to proscribe unregulated actions.\n\nThe above notwithstanding, sending a message (in general or with\nspecific attributes) is never a regulated action; however, the\nrules may be interpreted so as to proscribe sending public\nmessages (in general or with specific attributes).\n","power":3},{"title":"The Assessor","id":"2137","text":"The Assessor is an office; its holder is responsible for\ncollecting votes and keeping track of related properties.\n","power":1},{"title":"Recordkeepors","id":"2698","text":"For some entity or class of entities to be \"tracked by\" another\nentity is for the latter entity to be its recordkeepor.\n\nFor an entity to be a recordkeepor for a type of switch is for\nthat entity to be the recordkeepor for all instances of that\nswitch.\n\nWhere the rules specify a recordkeepor for some set of instances\nof a switch, that recordkeepor's (weekly, if not specified\notherwise) report includes the value of each instance in that set\nwhose value is not its default value; a public document purporting\nto be this portion of that recordkeepor's report is\nself-ratifying, and implies that other instances in that set are\nat their default value.\n\nThe recordkeepor of a class of assets is the entity (if any)\ndefined as such by, and bound by, its backing document. That\nrecordkeepor's report includes a list of all instances of that\nclass and their owners. A public document purporting to be this\nportion of that recordkeepor's report is self-ratifying.\n","power":3.0},{"title":"Official Patent Titles","id":"2581","text":"The following Patent Titles CAN be awarded by the indicated\nOfficers with 2 Agoran consent.  In order to balance the history,\ndignity, spontaneity, and serendipity of the awards, the Herald,\nSpeaker, and Prime Minister are STRONGLY ENCOURAGED to provide\ntheir support or objections, and reasons for doing so, reasonably\nquickly after any such intents are announced.\n\n - Tapecutter, awardable by the Rulekeepor to the author of an\n   adopted proposal that significantly reduces, streamlines, or\n   simplifies the ruleset.\n\n - Scamster, awardable by the Referee to any player who has shown\n   great enthusiasm, persistence, or skill in the perpetrating of\n   scams without breaking any Rules.\n\n - Hard Labor, awardable by the ADoP to any player who holds 2+\n   offices for 3+ continuous months while performing eir official\n   duties in a timely and conscientious manner that promotes the\n   gameplay of the office.\n\n - MacGyver, awardable by the Assessor to the author of an adopted\n   proposal that fixes serious bugs in the ruleset, especially if\n   the fix uses existing rules text in novel and unexpected ways,\n   or to a judge for similarly using rules text to resolve an\n   apparent bug without the need for legislative action.\n\n - Bard, by Speaker the award should given be, to persons who\n   publish repeated creative wit or poetry.\n\n - Helping Hand, awardable by any Officer to any person not\n   holding that office who puts substantial labor into aiding in\n   the duties of that office, without consideration of any other\n   reward they might receive.\n   \n - Tiger Team, awardable by any Officer to any player who points\n   out a usable rules bug that would directly provide em with a\n   strong game advantage if e used it, but proposes a fix without\n   attempting to use the bug.\n\n - Terms of Service, awardable by the Notary to any player who\n   creates multiple Contracts that achieve fun gameplay and\n   significantly impacts Agora as a whole\n\nThe Herald is also ENCOURAGED to proactively recommend or, as\notherwise permitted, award these titles when appropriate,\nespecially if the potential awardee is the officer emself.\n","power":1},{"title":"Submitting a CFJ to the Referee","id":"2246","text":"When a person initiates a Call for Judgement, e CAN, optionally,\nsubmit it to the Referee by announcement. All persons are\nENCOURAGED to submit a case to the Referee only when there is a\ngood reason not to let it be processed by the Arbitor as usual.\n\nWhen a CFJ is submitted to the Referee, the Referee receives all\nobligations and powers, other than obligations to report, for that\ncase that the Arbitor would otherwise receive due to being\nArbitor. This rule takes precedence over Rules that would\notherwise assign duties and powers regarding to a judicial case to\nthe Arbitor.\n","power":2},{"title":"Power","id":"1688","text":"The Power of an entity is a non-negative rational number. An\ninstrument is an entity with positive Power.\n\nThe Power of an entity cannot be set or modified except as\nstipulated by the Rules. All entities have Power zero except where\nspecifically allowed by the rules.\n\nA Rule that makes a change, action, or value secured (hereafter\nthe securing Rule) thereby makes it IMPOSSIBLE to perform that\nchange or action, or to set or modify that value, except as\nallowed by an instrument with Power greater than or equal to the\nchange's Power Threshold. This Threshold defaults to the securing\nRule's Power, but CAN be lowered as allowed by that Rule\n(including by the Rule itself).\n\nA Rule that designates the creation of an entity of a given type\nas secured (to a given extent) thereby designates the causing of\nan entity to have that type as secured (to the same extent).\nSimilarly, a Rule that designates the destruction of an entity of\na given type as secured (to a given extent) thereby designates the\ncausing of an entity to cease to have that type as secured (to the\nsame extent).\n","power":3},{"title":"Performing Tabled Actions","id":"2124","text":"For a given tabled intent, a player CAN, unless otherwise\nforbidden by the rules or the document enabling the action, act on\neir own behalf, by announcement, to:\n* Become a supporter (\"support\" it), unless e tabled or previously\n  supported it;\n* Become an objector (\"object to\" it), unless e previously\n  objected to it;\n\nA supporter/objector to an intent, acting as emself, CAN by\nannouncement cease to be a supporter/objector (\"withdraw\"\nsupport/objection) of that intent.\n\nLimiting the ability to support or object to an intent is secured\nat the power of the rule enabling that action to be performed.\n\nAn intent is ripe if was tabled within the past 14 days, the\nSpeaker hasn't objected to it in the past 48 hours, and its\nconditions, if any, are each clearly and unambiguously met.\n\nAn intent is mature if it was tabled at least 4 days ago and\nnobody withdrew objections from it in the past 24 hours.\n\nA rule purporting to allow a person to perform a tabled action\nallows em to do so by announcement, if, considering only intents\nfor that action/method combination:\n* With N Support: e is a sponsor or supporter of a ripe intent with\n  at least N supporters.\n* Without N Objections: e is a sponsor of a mature ripe intent with\n  less than N objectors.\n* With N Agoran Consent: e is a sponsor or supporter of a mature\n  ripe intent with supporters greater than N times its objectors\n  (e SHOULD list supporters and objectors).\n* With T notice: e is the sponsor of a ripe intent created at\n  least T ago.\n","power":3},{"title":"Election Procedure","id":"2154","text":"When an election is initiated, it enters the nomination period,\nwhich lasts for 4 days. After an election is initiated and until\nnominations close, any player CAN become a candidate by\nannouncement. A candidate ceases to be a candidate if e ceases to\nbe a player during the election or if holding the office would\nmake em Overpowered. During the nomination period, a candidate CAN\ncease to be a candidate by announcement if there is at least one\nother candidate.\n\nEach candidate in an election is ENCOURAGED to campaign by\nindicating why e would be the best choice, and (if applicable) how\ne would run the office differently than the previous holder.  The\nADoP SHOULD remind candidates to campaign.\n\nAn election whose nomination period is complete is contested if it\nhas two or more candidates, and uncontested otherwise. Nominations\nclose at the end of the poll's voting period or when the election\nis ended, whichever comes first.\n\nAfter the nomination period ends, the ADoP (or, if the office is\nthe ADoP, the Assessor) CAN and, in a timely fashion, SHALL:\n\n1) If the election is contested, initiate an Agoran decision to\n   select the winner of the election (the poll). For this\n   decision, the Vote Collector is the ADoP (or, if the office is\n   the ADoP, the Assessor), the valid options are the candidates\n   for that election (including those who become candidates after\n   its initiation), and the voting method is instant runoff. When\n   the poll is resolved, its outcome, if a player, wins the\n   election. If the outcome is not a player, the election ends\n   with no winner.\n\n2) If POSSIBLE per the following paragraph, end the election\n   immediately.\n\nIf at any point an uncontested election has a single candidate,\nthen any player CAN by announcement declare em the winner of the\nelection, thereby causing em to win the election. If at any point\nan uncontested election has no candidates, then any player CAN\ndeclare the election ended with no winner by announcement.\n\nWhen a player wins an election, e is installed into the associated\noffice and the election ends.\n","power":2},{"title":"Determining the Will of Agora","id":"955","text":"Each Agoran decision has a voting method, which determines how\nvoters may vote on it and how to calculate the outcome. The\nstrength of a ballot is the voting strength of the voter who cast\nit on that Agoran decision, as calculated at the end of that\ndecision's voting period.\n\n1. For an AI-majority decision, let F be the total strength of all\n   valid ballots cast FOR a decision, A be the same for AGAINST,\n   and AI be the adoption index of the decision. The outcome is\n   ADOPTED if F/A >= AI and F/A > 1 (or F>0 and A=0), otherwise\n   REJECTED.\n\n2. For an instant runoff decision, the outcome is whichever option\n   wins according to the standard definition of instant runoff.\n   For this purpose, a ballot of strength N is treated as if it\n   were N distinct ballots expressing the same preferences. In\n   case multiple valid options tie for the lowest number of votes\n   at any stage, the vote collector CAN and must, in the\n   announcement of the decision's resolution, select one such\n   option to eliminate; if, for M > 1, all eir possible choices in\n   the next M stages would result in the same set of options being\n   eliminated, e need not specify the order of elimination. If an\n   entity that is part of a valid vote is not a valid option at\n   the end of the voting period, or disqualified by the rule\n   providing for the decision, then that entity is eliminated\n   prior to the first round of counting.\n\n3. For a first-past-the-post decision, the outcome is whichever\n   option received the highest total strength of valid ballots. In\n   case of a tie, the vote collector CAN and must, in the\n   announcement of the decision's resolution, select one of the\n   leaders as the outcome.\n\nThe previous notwithstanding:\n\n- If there is more than one option, and the number of voters is\n  less than the quorum of that decision, the outcome is instead\n  FAILED QUORUM.\n\n- If there are no valid options, the outcome is null.\n\nThe outcome of a decision is determined when it is resolved, and\ncannot change thereafter.\n","power":3},{"title":"The Speaker","id":"103","text":"The Speaker is an imposed office and the figurehead leader of\nAgora. The player or players who have most recently won the game\nare called Laureled. If at any time the office of Speaker is\nvacant, or when one or more players win Agora, then the Prime\nMinister CAN once appoint a Laureled player to the office of\nSpeaker by announcement.\n\nWhenever the Prime Minister CAN appoint a Laureled player to the\noffice of Speaker, e SHALL do so in a timely fashion, except that\nthe Prime Minister MAY defer appointing a new Speaker while there\nis pending one or more open CFJs that could plausibly determine or\naffect the question of whether a player is Laureled.  If the Prime\nMinister is emself Laureled, eir power to appoint a Speaker\ncontinues for the entirety of a message in which e resigns as\nPrime Minister, and if e is the only Laureled player, e CAN void\nthat power, and thereby discharge the obligation to use it, by\nannouncing that e declines to take the office.\n\nIf the office of Speaker has been held continuously by the same\nperson for the past 90+ days, then any player CAN appoint another\nplayer to the office with support.\n","power":2},{"title":"Voting Strength","id":"2422","text":"The voting strength of an entity on an Agoran decision is an\ninteger between 0 and 15 inclusive, defined by rules of power 2 or\ngreater. If not otherwise specified, the voting strength of an\nentity on an Agoran decision is 3.\n\nWhen multiple rules set or modify an entity's voting strength on\nan Agoran decision, it shall be determined by first applying the\nrule(s) which set it to a specific value, using the ordinary\nprecedence of rules, and then applying the rules, other than this\none, which modify it, in numerical order by ID. Finally, if the\nresult of the calculation is not an integer, it is rounded up, and\nthen if it is outside the allowable range of values for voting\nstrength, it is set to the minimum value if it was less and the\nmaximum value if it was more.\n","power":3},{"title":"The Associate Director of Personnel","id":"2138","text":"The Associate Director of Personnel (ADoP) is an office; its\nholder is responsible for keeping track of officers.\n\nThe ADoP's report includes the following:\n\n1. The date of the last change (if any) to each office's\n   Officeholder.\n2. The current status of the ongoing election for that office or,\n   if there is no ongoing election for that office, the date on\n   which the last election ended\n3. For filled elected offices, whether or not the holder is\n   interim.\n4. For offices with a weekly and/or monthly report, the date (if\n   any) that each was most recently published.\n","power":1},{"title":"Succumbing to Time","id":"2667","text":"A player CAN Succumb by announcement. Upon doing so, if e has not\nalready Succumbed that month, then each of eir deadlines to\nperform an Officer's duty or judge a Call for Judgement is\nextended by 1 day if it would otherwise expire within the next\nweek.\n","power":1},{"title":"Office Incompatibilities","id":"2472","text":"Some pairs of office are incompatible:\n\n1. Prime Minister and Speaker\n\n2. Promotor and Assessor\n\n3. Assessor and ADoP\n\n4. Referee and Arbitor\n\nA player is Overpowered if e holds two offices which are\nincompatible with each other. Rules to the contrary\nnotwithstanding, a player CANNOT be installed into an office if\ndoing so would make em Overpowered.\n\nIf a player is Overpowered, any player CAN, with Notice, Demand\nResignation from em. When this occurs, each office that the\nOverpowered player holds becomes vacant.\n","power":2},{"title":"The Rulekeepor","id":"1051","text":"The Rulekeepor is an office; its holder is responsible for\nmaintaining the text of the rules of Agora.\n\nThe Rulekeepor's weekly report includes the Short Logical Ruleset.\nThe Rulekeepor's monthly report includes the Full Logical Ruleset.\n","power":1},{"title":"Vote Protection and Cutoff for Challenges","id":"2034","text":"A public message purporting to resolve an Agoran decision is a\nself-ratifying attestation that\n\n1. such a decision existed,\n\n2. it had the number of voters indicated,\n\n3. it was resolved as indicated, and\n\n4. (if the indicated outcome was to adopt a proposal) such a\n   proposal existed, was adopted, and, if it had not\n   previously taken effect, took effect.\n","power":3},{"title":"Determinacy","id":"2518","text":"If a value cannot be reasonably determined (without circularity or\nparadox) from information reasonably available, or if it\nalternates indefinitely between values, then the value is\nconsidered to be indeterminate, otherwise it is determinate.\n\nA communication purporting to express conditional intent to\nperform an action is considered unclear and ambiguous unless, at a\nminimum, the conditional is determinate, true, and reasonably\nstraightforward to evaluate with publicly-available information at\nthe time of communication. The communicator SHOULD explain\nspecific reasons for being uncertain of the outcome when e makes\nthe communication.\n","power":3},{"title":"The Boulder","id":"2683","text":"The Absurdor is a sortitioned office.\n\nThe Boulder's Height is a singleton integer switch defaulting to\n0, tracked by the Absurdor.\n\nThe Boulder's Slope is a singleton integer switch defaulting to 1,\ntracked by the Absurdor.\n\nEach player CAN, once a week, by announcement, push the boulder.\nWhen a player pushes the Boulder, its Height is increased by 1.\nAt the beginning of each week, if the boulder was pushed in the\nprevious week at least as many times as the Boulder's Slope, then\nthe Boulder's Slope is increased by 1; otherwise, the Boulder's\nHeight is set to 0, and the Boulder's Slope is set to 1. The\nAbsurdor SHOULD list the largest Height and Slope of the Boulder\never reached in eir report.\n","power":0.5},{"title":"Fora","id":"478","text":"Publicity is a secured forum switch with values Public,\nDiscussion, and Foreign (default), tracked by the Registrar.\n\nThe Registrar CAN change the publicity of a forum without\nobjection as long as:\n\n1. e sends eir announcement of intent to that forum; and\n\n2. if the forum is to be made public, the announcement by which\n   the Registrar makes that forum public is sent to all existing\n   public fora.\n\nEach player should ensure e can receive messages via each public\nforum.\n\nA public message is a message sent via a public forum, or sent to\nall players and containing a clear designation of intent to be\npublic. A rule can also designate that a part of one public\nmessage is considered a public message in its own right. To\n\"publish\" or \"announce\" something is to send a public message\nwhose body contains that thing. To do something \"publicly\" is\nto do that thing within a public message.\n\nWhere the rules define an action that a person CAN perform \"by\nannouncement\", that person performs that action by, in a single\npublic message, specifying the action and setting forth intent to\nperform that action by sending that message, doing both clearly\nand unambiguously.\n\nAny action performed by sending a message is performed at the time\ndate-stamped on that message. Actions in messages (including\nsub-messages) are performed in the order they appear in the\nmessage, unless otherwise specified. Allowing regulated actions\nperformed by sending a message to take place simultaneously must\nbe done explicitly and is secured at power 2.\n","power":3},{"title":"Contracts","id":"1742","text":"Any group of one or more consenting persons (the parties) may\npublicly make an agreement among themselves with the intention\nthat it be binding upon them and be governed by the rules. Such\nan agreement is known as a contract. A contract may be modified,\nincluding by changing the set of parties, with the consent of all\nexisting parties. A contract may also be terminated with the\nconsent of all parties. A contract automatically terminates if the\nnumber of parties to it falls below one. It is IMPOSSIBLE for a\nperson to become a party to a contract without eir consent.\n\nParties to a contract governed by the rules SHALL act in\naccordance with that contract. This obligation is not impaired\nby contradiction between the contract and any other contract, or\nbetween the contract and the rules.\n\nRules to the contrary notwithstanding, any change that would cause\nthe full provisions or parties of a contract to become publicly\nunavailable is canceled and does not take effect.\n\nThe portion of a contract's provisions that can be interpreted\nwith reference only to information that is either publicly or\ngenerally available are known as its body; the remainder of the\nprovisions are known as the annex.\n\nA party to a contract CAN perform any of the following actions as\nexplicitly and unambiguously permitted by the contract's body:\n\n* Act on behalf of another party to the contract.\n\n* By announcement, revoke destructible assets from the contract.\n\n* By announcement, transfer liquid assets from the contract to a\n  specified recipient.\n\nAny player CAN cause a contract to be terminated (syn. \"shred\")\nwithout 2 objections. This SHOULD only be done to remove unused\ncontracts or contracts deemed detrimental to the game as a whole.\n","power":2.5},{"title":"Offices","id":"1006","text":"An Office is a position described as an Office by the Rules.\nOfficeholder is an office switch tracked by the ADoP, with\npossible values of any person or \"vacant\" (default). Each instance\nof the Officeholder switch is secured at the power of the Rule\ndefining the associated office (or the power of this Rule, if the\ndefining Rule's power is higher). An officer is the holder of an\noffice, who may be referred to by the name of that office. If the\nholder of an office is ever not a player, it becomes vacant.\n\nImposed offices and sortitioned offices are offices described as\nsuch by the rules that define them. All other offices are elected.\nAn office is voluntary if and only if it is elected or\nsortitioned. The selection method for a sortitioned office is a\nsortition for that office. The selection method for an elected\noffice is an election for that office.\n\nA person CANNOT be made the holder of a voluntary office without\neir consent. A person voluntarily entering emself into the\nselection method of that office always satisfies this requirement,\nregardless of whether it meets the normal definition of consent.\n\nThe holder of a voluntary office CAN resign it by announcement,\ncausing it to become vacant. Any player CAN cause a voluntary\noffice to become vacant without 2 objections.\n\nThe non-interim holder of an elected office CAN, with 3 support,\nresign the office while appointing another player to become the\nholder of the office, provided that other player is one of the\nsupporters.\n\nImmediately after a proposal finishes taking effect, if one or\nmore offices exist that did not exist prior to the proposal taking\neffect, each such office, if it is vacant, becomes held by the\nauthor of the proposal.\n","power":2},{"title":"Deputisation","id":"2160","text":"A player acting as emself (the deputy) CAN perform an action\nordinarily reserved for an office-holder as if e held the office\nif all of the following are true:\n\n 1) The rules require the holder of that office, by virtue of\n    holding that office, to perform the action. (This requirement\n    is fulfilled by the deputy performing the action.)\n\n 2) It would be POSSIBLE for the deputy to perform the action,\n    other than by deputisation, if e held the office.\n\n 3) The deputy, when performing the action, announces that e is\n    doing so by deputisation or by temporary deputisation.\n\n 4) The deputy has not held the office in the past 7 days.\n\n(If the office is vacant, then the remaining items in this list\nneed not be true.)\n\n 5) A time limit by which the rules require the action to be\n    performed has expired.\n\n 6) The office's holder has not changed in the past 7 days.\n\n 7) Any of the following are true:\n\n    a) The deputy announced between 2 and 14 days earlier that\n       e intended to deputise for that office for the purposes of\n       the particular action.\n\n    b) The time limit expired between 14 and 28 days ago.\n\n    c) The time limit expired more than 28 days ago, and the\n       deputisation is temporary.\n\nWhen a player deputises for a voluntary office, e becomes the\nholder of that office, unless the deputisation is temporary, doing\nso would make em Overpowered, and/or the action being performed\nwould already install someone into that office.\n","power":3},{"title":"Voting on Agoran Decisions","id":"683","text":"An entity submits a ballot on an Agoran decision by publishing a\nnotice satisfying the following conditions:\n\n1. The ballot is submitted during the voting period for the\n   decision.\n\n2. The entity casting the ballot (the voter) was, at the\n   initiation of the decision, a player.\n\n3. The ballot clearly identifies the matter to be decided.\n\n4. The ballot clearly identifies a valid vote, as determined by\n   the voting method.\n\n5. The ballot clearly sets forth the voter's intent to place\n   the identified vote.\n\n6. The voter has no other valid ballots on the same decision.\n\nA valid ballot is a ballot, correctly submitted, that has not been\nwithdrawn. During the voting period of an Agoran decision, an\nentity CAN by announcement withdraw (syn. retract) a ballot that e\nsubmitted on that decision. To \"change\" one's vote is to retract\neir previous ballot (if any), then submit a new one. Submitting\nand withdrawing ballots is secured.\n","power":3},{"title":"Degrees","id":"1367","text":"Certain patent titles are known as degrees. The degrees are\n\n- Associate of Nomic Art             (A.N.A.)\n- Associate of Nomic                 (A.N.)\n- Juris Doctorate of Nomic           (J.N.)\n- Baccalaureate of Nomic Art         (B.N.A.)\n- Baccalaureate of Nomic             (B.N.)\n- Magisteriate of Nomic Art          (M.N.A.)\n- Magisteriate of Nomic              (M.N.)\n- Doctorate of Nomic Art             (D.N.Art.)\n- Doctorate of Nomic History         (D.N.Hist.)\n- Doctorate of Nomic Law             (D.N.Law.)\n- Doctorate of Nomic Science         (D.N.Sci.)\n- Doctorate of Nomic Philosophy      (D.N.Phil.)\n\nThere are four classes of degrees, ranked in ascending order of\nmerit: Associate degrees (A.N.A. and A.N.), Baccalaureate degrees\n(J.N through B.N.), Magisteriate degrees (M.N.A and M.N), and\nDoctorate degrees (D.N.Art. through D.N.Phil.).\n\nA specified degree CAN be awarded by any player other than the\nawardee, with 2 Agoran consent. It SHOULD only be awarded for the\npublication of an original thesis of scholarly worth (including\nresponses to peer-review), published with explicit intent to\nqualify for a degree. The Herald SHOULD coordinate the peer-review\nprocess and the awarding of degrees.\n\nThe Herald is ENCOURAGED to enact administrative regulations\nincluding specific guidelines on how to submit theses, a detailed\ndescription of the peer-review process, and specific\nqualifications for degrees in general and for specific degrees.\n\nDegrees SHOULD be awarded according to the extent to which the\nthesis contributes to Nomic culture or thought: Associate degrees\nfor an appreciable contribution, Baccalaureate degrees for a\nsubstantial contribution, Magisteriate degrees for a remarkable\ncontribution, and Doctorate degrees for an exceptional\ncontribution. Any degree at the Doctorate level SHOULD take into\naccount the awardee's academic history and participation in Agora\nover time.\n\nTheses for Art degrees SHOULD demonstrate substantial creativity\nand need not be in written form. Theses for all other degrees\nSHOULD demonstrate substantial research or analysis. J.N.  and\nD.N.Law are appropriate for high-quality legal analysis, of the\nsort typical to CFJs, but exceeding an ordinary CFJ in depth.  The\nD.N.Hist. degree is appropriate for historical research,\nespecially when it presents a narrative that educates Agorans\nabout the events of the past. The D.N.Sci. degree is appropriate\nfor theses that demonstrate concrete or scientific thinking,\nwhereas the D.N.Phil. is appropriate for theses that demonstrate\nabstract or philosophical thinking.\n","power":2},{"title":"Agoran Numbers","id":"2509","text":"A \"number\" is considered to refer to a real number, unless\notherwise explicitly specified.  A \"number of (items)\", where\n(items) is a set of discrete entities, is considered to refer to a\nnon-negative integer, unless otherwise explicitly specified.\n\nIf a switch is defined as being associated with a specified set of\nnumbers (a numerical switch), then the possible values for that\nswitch are the numbers in that set. In particular, a natural or\ninteger switch is a switch with possible values the non-negative\nintegers or all integers, respectively. If a limit is further\ndefined, the possible values are the numbers of the set within the\nspecified limits.\n\nIf the rules describe mathematical operations to be used in\nflipping an instance of a numerical switch, the operations are\ninterpreted as having common-sense mathematical application to\ndetermine that instance's resulting value. For example,\n\"increasing a switch instance by M\" is equivalent to \"flipping a\nswitch instance from its current value N to the value N+M\". If the\nspecified mathematical operation would result in a value outside\nthat switch's defined set, the flipping CANNOT be performed, rules\nto the contrary notwithstanding.\n","power":2},{"title":"Distribution","id":"1607","text":"The Promotor is an office; its holder is responsible for receiving\nand distributing proposals.\n\nA referendum is the Agoran decision to determine whether to adopt\na proposal (its associated proposal).  For this decision, the vote\ncollector is the Assessor, the adoption index is initially the\nadoption index of the proposal, and the text, author, coauthors,\nand class of the proposal are essential parameters. Initiating a\nreferendum is known as distribution, and removes the proposal from\nthe Proposal Pool.\n\nThe Promotor CAN distribute a proposal which is in the Proposal\nPool at any time.\n\nIn a given Agoran week, the Promotor SHALL distribute each\nproposal that was in the Proposal Pool at the beginning of that\nweek, except for those excepted from automatic distribution by\nother rules, or those that are otherwise removed from the Pool. If\nthere are ten or more undistributed proposals in the proposal\npool, the Promotor MAY refrain from distributing the most recently\nadded 5 proposals if e distributes each other proposal in that\nAgoran week.\n\nDistributed proposals have ID numbers, to be assigned by the\nPromotor.\n\nIf there is a Proposal in the Pool that it would otherwise be\nIMPOSSIBLE for any player to distribute, then any player CAN\ndistribute that Proposal without 3 objections.\n\nThe Promotor's report includes a list of all proposals in the\nProposal Pool, along with their text and attributes. This portion\nof a public document purporting to be a Promotor's report is\nself-ratifying.\n\nThe destruction of a referendum is secured.\n","power":3},{"title":"Crop Seasons","id":"2705","text":"The Crop Season is determined by the current Agoran month:\n\n  * Spring - January, May, September\n  * Summer - February, June, October\n  * Autumn - March, July, November\n  * Winter - April, August, December\n","power":1.0},{"title":"Consent","id":"2519","text":"A person is deemed to have consented to an action if and only if,\nat the time the action took place:\n\n1. e, acting as emself, has publicly stated that e agrees to the\n   action and not subsequently publicly withdrawn eir statement;\n2. e is party to a contract whose body explicitly and\n    unambiguously indicates eir consent;\n3. the action is taken as part of a promise which e created; or\n4. it is reasonably clear from context that e wanted the action to\n   take place or assented to it taking place.\n","power":3},{"title":"Restrictions on Participation","id":"2679","text":"Banned is a secured negative boolean person switch tracked by the\nRegistrar. A person is unwelcome if e is Banned or if at least one\npart of em is unwelcome. Rules to the contrary notwithstanding, an\nunwelcome person CANNOT register or be registered, and e is\nimmediately deregistered if e is ever a player. Designations of\nunwelcomeness are secured.\n\nA Banned switch SHOULD ONLY be flipped by a proposal for the\nexpress purpose of flipping Banned switches.\n\nFlipping a Banned switch to True (banning a player) SHOULD ONLY be\ndone when:\n\n* the person's actions have been deemed harmful to Agora, to any\n  player of Agora, or the overall community, and\n\n* the harm has been clearly communicated to the person, and e has\n  been given time to consider and respond, and\n\n* e has made no attempt to make amends, eir attempt was\n  unsatisfactory, or e has continued to act in harmful ways.\n\nActions that are harmful are subject to the discretion of the\ncommunity of Agora, but may include: any form of identity-based\ndiscrimination, personal attacks, disrespect of values or beliefs\nof any member of the Agoran community, or provocative/bad-faith\ncomments.\n\nOnce a quarter, any unwelcome person may submit a Request for\nForgiveness to the Registrar. Such a document SHOULD contain\nsincere self-reflection including any appropriate apologies and an\nindication on how e intends to avoid or prevent similar incidents\nin the future.\n\nThe Registrar SHALL publish any Request for Forgiveness e receives\nin a timely fashion. If the community deems the Request sincere\nand appropriately reconciliatory, steps should be undertaken to\nflip the submitter's Banned switch to False.\n","power":3},{"title":"Tournaments","id":"2464","text":"A Tournament is a sub-game of Agora specifically sanctioned to be\ninitiated as a tournament by the Rules. Each time that one or more\nwinners of a tournament are determined before it concludes, that\nperson or those persons win the game. A tournament concludes when\nits regulations state that it concludes. Additionally, if it has\nnot previously concluded, a tournament concludes 3 months after\nits initiation.\n\nA Tournament is governed by a set of regulations, created in\naccordance with its parent rule, which have binding control over\nthose who freely consent to oversee or participate in the\ntournament and over the tournament itself. When a tournament is\ninitiated, its governing regulations are enacted. Once the\ntournament is concluded, these regulations cease to have any\neffect, and CAN be repealed by any player by announcement. A\nTournament's regulations collectively have Mint Authority.\n\nUnless otherwise specified by the tournament's regulations, the\ngamemaster of a tournament is the person who initiated it.\n\nA tournament's regulations can provide for the enactment,\namendment, and repeal of regulations for that tournament; if the\nregulations are silent, the gamemaster CAN, with 2 Agoran consent,\nenact, amend, or repeal such regulations. Any regulations so\nenacted are deemed to be regulations of the same tournament.\n","power":1},{"title":"Activity","id":"2646","text":"Activity is a secured player switch tracked by the Registrar, with\nvalues Active (default) and Inactive.  To flip a player's activity\nto active (inactive) is to activate (deactivate) em.  The date on\nwhich each player's activity was last changed is part of the\nRegistrar's weekly report.\n\nA player CAN, acting as emself, activate or deactivate emself by\nannouncement.\n\nAny player CAN, with notice, make a player who has not made a\npublic announcement in the past 30 days inactive.\n\nIf a player has been inactive continuously for the past 60 days,\nthen any player CAN deregister em without 3 objections. The\nRegistrar SHOULD attempt to deregister players who meet this\ncondition. The publication of intent for such a deregistration\nSHOULD be sent to the inactive player's registered email address\nat the same time that it is published.\n","power":3},{"title":"Proposal Classes","id":"2606","text":"Proposals created since the enactment of this rule have a secured\nuntracked Class switch with possible values ordinary (the default)\nand democratic.\n\nWhen a proposal with an adoption index greater than or equal to\n3.0 is created, its class becomes democratic.\n\nAny player CAN, with 2 Agoran consent, flip an ordinary proposal's\nclass to democratic, provided that it is in the Proposal Pool or\nthat there is a referendum on it whose voting period has not yet\nended.\n","power":2.0},{"title":"Ratification Without Objection","id":"2202","text":"A public document is part (possibly all) of a public message.\n\nA player CAN, without objection, ratify a specified public\ndocument.\n\nRatification Without Objection CANNOT cause the repeal, amendment,\nenactment, or mutation of any Rule, rules to the contrary\nnotwithstanding.\n\nA player SHALL NOT knowingly use or announce intent to use\nRatification Without Objection to ratify a (prior to ratification)\ndocument containing incorrect or Indeterminate information when a\ncorrected document could be produced with reasonable effort,\nunless the general nature of the document's error and reason for\nratifying it is clearly and plainly described in the announcement\nof intent. Such ratification or announcement of intent to ratify\nis the Class 8 Infraction of Endorsing Forgery.\n","power":3},{"title":"The Logical Rulesets","id":"1681","text":"The Short Logical Ruleset (SLR) is a format of the ruleset. In\nthis format, each rule is assigned to a category, and the rules\nare grouped according to their category.\n\nRules are assigned to, ordered within, or moved between\ncategories, and categories are added, changed, or empty categories\nremoved, as the Rulekeepor sees fit.\n\nThe listing of each rule in the SLR must include the rule's ID\nnumber, power, title, and text.\n\nThe listing of each rule in the SLR must additionally include a\nrevision number selected by the Rulekeepor. The Rulekeepor SHOULD\nselect revision numbers such that they can be used retrospectively\nto determine that the text of a rule has changed while it\nmaintained the same ID number. The Rulekeepor may exercise\nreasonable discretion in calculating revision numbers.\n\nThe Rulekeepor is strongly DISCOURAGED from including any\nadditional information in the SLR, except that which increases the\nreadability of the SLR.\n\nThe Full Logical Ruleset (FLR) is a format of the ruleset. In this\nformat, rules are assigned to the same category and presented in\nthe same order as in the SLR. The FLR must contain all the\ninformation required to be in the SLR, and any historical\nannotations which the Rulekeepor is required to record.\n\nThe Rulekeepor SHOULD also include any other information which e\nfeels may be helpful in the use of the ruleset in the FLR.\n\nWhenever a rule is changed in any way, the Rulekeepor SHALL record\nand thereafter maintain a reasonably accurate historical\nannotation to the rule indicating:\n\n1. The type of change.\n\n2. The date on which the change took effect.\n\n3. The mechanism that specified the change.\n\n4. If the rule was changed due to a proposal, then that proposal's\n   ID number, author, and coauthor(s) (if any).\n","power":1},{"title":"Win by Paradox","id":"2553","text":"If a CFJ about the effectiveness, possibility, or legality of a\nchange in the gamestate has been assigned a judgement of\nPARADOXICAL continuously for between 7 and 90 days, then that\ncase's initiator, CAN, by announcement, Transcend Logic,\nspecifying that CFJ, provided that e has not already won the game\nwith respect to that CFJ or to a CFJ linked to it. When a person\ntranscends logic, e wins the game.\n\nA player who wins in this fashion SHOULD submit a proposal to\nprevent the paradox from arising again.\n","power":1},{"title":"The Election Cycle","id":"2651","text":"A holder of an elected office who did not become its holder by\nwinning an election, and has not won an election for that office\nsince, is an interim holder. An elected office that is either\nvacant or has an interim holder is an interim office.\n\nAn office is term-limited if the most recent election for that\noffice was resolved more than the length of that office's term\nprior. The term for the office of Prime Minister is 90 days. The\nterm for all other elected offices is 180 days.\n\nA player CAN initiate an election for a specified elected office:\n\na) With 2 support (if the office is either interim or term-\nlimited) or 4 support (otherwise), and provided that the initiator\nbecomes a candidate in the same message.\n\nb) By announcement, if e is the ADoP (or, if the office is the\nADoP, if e is the Assessor) and the office is interim, or if e is\nthe holder of that office.\n\nOnce per quarter, the ADoP CAN and SHALL publish a Notice of\nElection specifying between 2-4 term-limited offices (if there\nfewer than 2 term-limited offices, the ADoP MUST instead list all\nof them).  Such a notice initiates elections for the specified\noffices.  The ADoP SHOULD prioritize offices that have gone\nlongest since their last elections.\n\nThe above notwithstanding, an election for an office CANNOT be\ninitiated if one is already in progress.\n","power":2},{"title":"Festivals","id":"2480","text":"Festivity is a secured singleton switch, whose possible values are\nintegers ranging from 0 inclusive to the number of defined types\nof Ribbon exclusive, and defaulting to 0. Festivity is tracked in\nthe Tailor's monthly report. In addition, while Festivity is\nnon-zero, the Tailor SHALL announce its value each week; a public\ndocument purporting to be such an announcement is self-ratifying.\nA Festival is ongoing whenever Agora's Festivity is non-zero.\n\nIf Agora's Festivity has had the same non-zero value for 14 days\nor more, or if it has a non-zero value and fewer than 5 players\nare Festive, then any player CAN flip it to 0 by announcement.\n\nA Festive person is a person whose Laudability is greater than or\nequal to Agora's Festivity. An N-Festive person is a person who\nwould be Festive, were Agora's Festivity N.\n\nFor any integer N greater than Agora's Festivity, an N-Festive\nplayer CAN flip Agora's Festivity to N with 4 support from other\nN-Festive players, unless Agora's Festivity has had a value\ngreater than or equal to N in the past 21 days.\n","power":3.1},{"title":"Forgiveness","id":"2676","text":"All infractions that have not been forgiven are unforgiven.\n\nAny player CAN, with Agoran Consent, \"forgive\" an unforgiven\ninfraction that occurred in the past 30 days. When an infraction\nis forgiven, if the infraction was investigated, a number of\nblots in the possession of the infracter equal to the number of\nblots specified by the investigation are destroyed or, if e has\nless blots than specified, all eir blots are destroyed. The\nprevious notwithstanding, a player cannot forgive or support an\nintent to forgive eir own infraction.\n","power":1.7},{"title":"Reports and Duties","id":"2143","text":"For each person:\n\n1. If any task is defined by the rules as part of that person's\n   weekly duties, then e SHALL perform it at least once each week.\n\n2. If any task is defined by the rules as part of that person's\n   monthly duties, then e SHALL perform it at least once each month.\n\nFor each office, if any information is defined by the rules as\npart of that office's weekly or monthly report, then its\nofficeholder SHALL maintain all such information, and eir weekly\nor monthly duties respectively include publishing a document or\nseries of documents, labelled as that office's report (or as that\noffice's weekly or monthly report as appropriate), that includes\nall such information.\n\nAny information defined by the rules as part of a person's report,\nwithout specifying which one, is part of eir weekly report.\nFailure of a person to perform any weekly duty required of em\nwithin the allotted time is the Class 1+N infraction of Weekly\nTardiness, where N is the number of times e has previously\ncommitted the infraction in the past month.\n\nFailure of a person to perform any monthly duty required of em\nwithin the allotted time is the Class 3 infraction of Monthly\nTardiness.\n\nAn official duty for an office is any duty that the Rules\nspecifically assign to that office's holder in particular\n(regardless of eir identity).\n\nA person publishing a report SHALL do so in plain text, with\ntabular data lining up properly when viewed in a monospaced font.\nPublishing a report that deviates from these restrictions is the\nClass 2 infraction of Making My Eyes Bleed.\n\nA player CAN, by announcement, petition a specified person with a\nspecified duty to take a specific action related to that duty.\nThat person SHOULD publicly respond to that petition in a timely\nfashion. A player CAN petition a specified non-vacant office in\nthe same fashion; its holder SHALL respond in the same fashion.\n","power":1},{"title":"Genetic Modification","id":"2710","text":"Once per Crop Season, a player CAN pay a fee of 500 Pyrite to\ncreate a new type of Crop, specifying its name. The Land Managor\nCAN once by announcement, and SHALL in a timely fashion, set its\nGrowth Season, Seed Cost, Growth Duration, and Sell Price to\nrandomly selected valid values.\n\nOnce per Crop Season, a player CAN pay a fee of 750 Pyrite to\nalter a type of out-of-season Crop's Seed Cost, Growth Duration,\nor Sell Price by up to 25% in either direction.\n\nOnce per Crop Season, a player CAN pay a fee of 10000 Pyrite to\nremove a type of out-of-season Crop.\n\nOnce per Crop Season, the Land Managor CAN and SHALL by\nannouncement randomly select a type of Crop that was in-season\nduring the previous season, select a random attribute (Seed Cost\nor Sell Price), and set that attribute to a randomly selected\nvalid value. If there is no such type to select, then e SHALL\ninstead announce that fact.\n","power":1.0},{"title":"Judicial Retraction and Excess","id":"2175","text":"A new case is a judicial case that has not had any judge assigned\nto it. The initiator of a new case CAN retract it by announcement,\nthus causing it to cease to be a judicial case.\n\nAn excess case is a new case whose initiator previously initiated\nfive or more cases during the same week as that case. A person\nSHALL NOT initiate an excess case. The Arbitor CAN refuse an\nexcess case by announcement, thus causing it to cease to be a\njudicial case. When e does so, e fulfills any obligations with\nregards to that case.\n","power":1},{"title":"Sortition Procedure","id":"2691","text":"A player CAN by announcement initiate a sortition for a vacant\nsortitioned office for which a sortition is not ongoing. At the\nbeginning of each quarter, for each sortitioned office for which a\nsortition is not ongoing, the ADoP CAN once by announcement, and\nSHALL in a timely fashion, initiate a sortition.\n\nRules to the contrary notwithstanding, a sortition CANNOT be\ninitiated for an office for which a sortition is ongoing.\n\nWhen a sortition is initiated, it enters the lots period. Any\nplayer CAN by announcement become an option for that office during\nthis period. If a person ceases to be a player during this period,\ne also ceases to be an option for each current sortition.\n\nSeven days after a sortition is initiated, its lots period ends,\nafter which:\n\n  * If it has two or more valid options, then the ADoP CAN by\n    announcement, and SHALL in a timely fashion after its lots\n    period ends, randomly select one of those options.\n\n  * If it has exactly one valid option, then any player CAN by\n    announcement select that option.\n\n  * If it has no valid options, then any player CAN by\n    announcement declare the sortition ended with no selection.\n\nWhen a player is selected in a sortition as described above, e is\ninstalled into the associated office and the sortition ends.\n\nIf a sortition is ever ongoing for a non-sortitioned office (or\nfor an office that no longer exists), that sortition immediately\nends.\n","power":2.0},{"title":"Cleanliness and Tidy Filing","id":"2221","text":"Any player CAN clean a rule without objection by specifying one or\nmore corrections to spelling, grammar, capitalization, formatting,\nand/or dialect, or to whether a synonym or abbreviation is used in\nplace of a word or phrase, in the rule's text and/or title; when e\ndoes so, if any text changes were specified, that rule is amended\nby this rule by applying the changes as a single amendment\n(failing as a whole if any fail); then, if any title changes were\nspecified, that rule is retitled by this rule by applying the\nchanges as a single retitling (failing as a whole if any fail).\n\nAny player CAN refile a rule without objection, specifying a new\ntitle; the rule is retitled to the specified title by this rule.\n\nCleaning rules is secured. Refiling rules is secured.\n","power":3},{"title":"Pyrite","id":"2707","text":"Pyrite is a type of fixed currency, tracked by the Land Managor.\n\nA player CAN pay a fee of 1 Spendie to gain 100 Pyrite.\n\nA player CAN pay a fee of 200 Pyrite to gain 1 Spendie, provided\nthat e has gained fewer than 40 Spendies in this way during this\nAgoran month.\n","power":1.0},{"title":"Penalties","id":"2556","text":"Rules to the contrary notwithstanding, an impure person CANNOT win\nthe game.\n\nThe voting strength of a person on an Agoran decision is reduced\nby 1 for every 3 blots in eir possession.\n\nA player CAN, with 7 days notice, deregister (exile) a specified\nplayer (the outlaw) who has more than 40 blots.\n","power":3},{"title":"Ratify the Ruleset Week","id":"2686","text":"The Agoran week each year containing the Ides of March is Ratify\nthe Ruleset Week. During Ratify the Ruleset Week, the Rulekeepor\nSHALL submit a proposal to ratify a purported ruleset published\nsince the last time the ruleset was ratified.\n","power":1.0},{"title":"No Cretans Need Apply","id":"2240","text":"In a conflict between clauses of the same Rule, if exactly one\nclaims precedence over the other, then it takes precedence;\notherwise, the later clause takes precedence.\n","power":3},{"title":"Recusal","id":"2492","text":"A judge CAN recuse emself from a CFJ e is assigned to by\nannouncement.\n\nThe Arbitor CAN recuse a judge from a case by announcement, if\nthat judge has violated a time limit for judging the case and has\nnot judged it in the mean time; the Arbitor SHALL do so in a\ntimely fashion after the time limit expires, if able. The Arbitor\nCAN recuse an inactive or unregistered judge by announcement.\n\nIf a judge is recused from a case that was continuously open and\nassigned to em for at least the past 4 days, e SHOULD NOT be\nassigned as a judge until e has apologised and/or reasonably\nexplained eir actions.\n","power":1},{"title":"Justice","id":"2478","text":"An Infraction is a violation of a rule. The person who committed\nan infraction is its infracter.\n\nThe Investigator for an infraction is the Referee unless e is the\ninfracter. Otherwise, it is the Arbitor.\n\nThe Class of an infraction is 2 unless a rule specifies a\ndifferent Class for it.\n\nThe Base of an infraction is N, where N is the number of\npreviously-investigated, unforgiven infractions that have been\ncommitted by the same person in the past 30 days. The previous\nnotwithstanding, if the base of an infraction would be greater\nthan its class, the infraction's base is equal to its class.\n\nWithin 14 days of an infraction being committed, or if the\ninfraction has been noted in the past 60 days, the Investigator\nCAN investigate the infraction by announcement, specifying a\nnumber of blots between the Base and the Class of the infraction,\ninclusive. When e does so, that many blots are created in the\npossession of the infracter.\n\nThe previous notwithstanding, an Investigator CANNOT investigate\nan infraction that has already been investigated or forgiven. The\nInvestigator of a noted, unforgiven infraction SHALL investigate\nthe infraction in a timely fashion after it has been noted;\nfailure to do so is the Class N infraction of Favoritism, where N\nis equal to the Class of the noted infraction.\n\nA player CAN, by announcement, \"note\" an unforgiven infraction\ncommitted by any other player in the past 14 days, specifying the\nincident and the rule it violates (or name of the Infraction if\nit has one); but a player CANNOT note an infraction that has\nalready been investigated.\n\nThe Referee's weekly report contains a list of noted and\ninvestigated Infractions committed in the previous week.\n","power":1.7},{"title":"Stamps","id":"2659","text":"Stamps are a category of asset ownable by players and contracts.\nThe Collector is a sortitioned office. The Collector tracks Stamps\nin eir weekly report.\n\nFor each person there is a corresponding type of stamp. Stamps of\nany given type are fungible.\n\nAny player CAN, once per week, pay X stamps, where each specified\nstamp is a different type, to gain (X-1)*3 radiance.\n\nAny player CAN, once per week, pay X Stamps, where each Stamp is\nthe same type, to gain (X-1)*2 radiance.\n\nAny active player CAN Profligately Pursue Philately by paying N\nStamps, where N is the current number of active players and each\nspecified Stamp is of a different type. When e does so, e wins the\ngame.\n\nAny player CAN pay a fee of 5 Spendies to grant emself X stamps of\neir own type. When less than 8 Stamps of eir type exist, X is 2.\nWhen 8 to 15 Stamps of eir type exist, X is 1. When 16 or more\nstamps of eir type exist, X is 0.\n\nAny player CAN pay a fee of 6 Spendies to transfer a specified\nstamp from the L&FD to emself.\n","power":1},{"title":"Winning the Game","id":"2449","text":"When the Rules state that a person or persons win the game, those\npersons win the game; specifically they win the Round that ends\nwith the indicated win. Agora itself does not end and the ruleset\nremains unchanged. The Herald is then authorized to award those\npersons the Patent Title of Champion once, by announcement.\n","power":3},{"title":"Executive Orders","id":"2451","text":"Once per week, except as otherwise forbidden by this rule, the\ncurrent Prime Minister CAN issue a Cabinet Order by announcement\nto perform the action(s) authorized by that Order.\n\nEach Cabinet Order is associated with an office. The current Prime\nMinister CANNOT issue more than one Cabinet Order associated with\nthe same office more than once in the same month, nor can e issue\na Cabinet Order associated with a vacant office.\n\nThe available Cabinet Orders are:\n\n- Certiorari (Arbitor): The Prime Minister assigns emself as judge\n  of a specified open case.\n\n- Dive (Referee): The Prime Minister levies a fine of 2 on a\n  specified player. Rules to the contrary notwithstanding, the\n  reason for the fine MAY be any grievance held by the Prime\n  Minister, not necessarily a violation of the rules, against the\n  person to whom the fine is levied.\n\n- Manifesto (Promotor): The Prime Minister distributes a specified\n  proposal in the Proposal Pool.\n","power":2},{"title":"How to Join and Leave Agora","id":"869","text":"Any entity (including a group of entities confederated with the\nintent of forming a single person under this Rule) that is or ever\nwas able to willingly communicate original ideas is a person.\nRules to the contrary notwithstanding, no other entities are\npersons.\n\nQuestions about personhood are to be resolved equitably, with\nregard for the good-faith of those involved and the customs of\nhonorable play.\n\nCitizenship is a secured person switch with values Unregistered\n(default) and Registered, tracked by the Registrar. A registered\nperson is a Player. To \"register\" someone is to flip that person's\nCitizenship switch from Unregistered to Registered.\n\nAn Unregistered person CAN (unless explicitly forbidden or\nprevented by Rules of power 3 or greater) register by sending a\npublic message that indicates reasonably clearly and reasonably\nunambiguously eir desire to be a player at that time (for example,\nby saying \"I register\"). Rules to the contrary notwithstanding,\ntwo or more persons CANNOT become Registered simultaneously.\n\nThe basis of a person is the set of all persons that are\n(recursively) part of em, in addition to emself. Rules to the\ncontrary notwithstanding, a person CANNOT become Registered if eir\nbasis overlaps with that of any current player.\n\nA player, acting as emself, CAN deregister (cease being a player)\nby announcement. If e does so, e CANNOT register or be registered\nfor 30 days.\n\nA person, by registering, agrees to abide by the Rules. The Rules\nCANNOT otherwise bind a person to abide by any agreement without\nthat person's willful consent.\n\nThe Rules CANNOT compel non-players to act without their express\nor reasonably implied consent. The rules CANNOT compel players to\nunduly harass non-players. A non-person CANNOT be a player, rules\nto the contrary notwithstanding.\n","power":3},{"title":"Birthday Gifts","id":"2585","text":"It is considered to be a player's Agoran Birthday on the\nanniversary of the day e first registered. If the day a player\nfirst registered is unknown, that player CAN, with Agoran consent,\ndeclare a day to be eir Agoran Birthday. As long as the day a\nplayer first registered remains unknown, it is considered to be\neir Agoran Birthday on the anniversary of the day e most recently\ndeclared as eir Agoran Birthday.\n\nIn a timely fashion after the start of a player's Agoran Birthday,\nthe Registrar SHALL announce it.\n","power":1},{"title":"Quorum","id":"879","text":"Each Agoran decision has a quorum. This is a number set when the\ndecision is created, and thereafter cannot be changed. When a\nperson initiates an Agoran decision, that person SHALL state the\nquorum of that decision. However, incorrectly stating the quorum\nof a decision does not invalidate the initiation, nor does it\nactually change the quorum of the decision.\n\nThe quorum that an Agoran decision gains as it is created can be\ndefined by other rules of power 2 or greater. If no other rule\ndefines the quorum of an Agoran decision, the quorum for that\ndecision is equal to 2/3 of the number of voters on the referendum\nthat had been most recently resolved at the time of that\ndecision's initiation, the whole rounded to the nearest integer.\n\nAs an exception to the previous paragraph, the minimum quorum of\nan Agoran decision is 2, or 1 if there are fewer than 2 players in\nthe game. If the rules would attempt to set the quorum of an\nAgoran decision to less than the minimum quorum, it is set to the\nminimum instead.\n","power":3},{"title":"No Faking","id":"2471","text":"A person SHALL NOT make a public statement that is a lie.\n\nA public statement is falsy if any of the following was true at\nthe time of publication:\n* The statement was not true and the author knew or should have\n  known that it was not true.\n* The author did not believe the statement to be true.\n\nA public statement is a lie if it is falsy and any of the\nfollowing is true:\n* The author made the statement with intent to mislead.\n* The author, in the same message, declared the statement to be\n  made \"under penalty of No Faking\" (or similar).\n\nFor the purposes of this rule, an attempt to perform an action by\npublishing certain text constitutes an implicit statement that the\naction was EFFECTIVE.\n\nMerely quoting a statement or attempt does not constitute making\nit for the purposes of this rule. Any disclaimer, conditional\nclause, or other qualifier attached to a statement or attempt\nconstitutes part of the statement or attempt for the purposes of\nthis rule; the truth or falsity of the whole is what is\nsignificant.\n\nThe above notwithstanding, a formal announcement of intent is\nnever a lie.\n","power":1},{"title":"Victory by Apathy","id":"2465","text":"A player CAN Declare Apathy without objection, specifying a set of\nplayers. Upon doing so, the specified players win the game, except\nfor those who have won the game through this Rule in the past 14\ndays.\n","power":0.3},{"title":"Town Fountain","id":"2029","text":"                /\\   /\\\n                / \\ / \\\n                   T\n                  his\n                Power-04\n         Rule (the first ever)\n          was placed to honor\n     The Agoran  Spirit Of The Game\n     by G., Steve, Murphy, root\n     and OscarMeyr, Scamsters. Look\n     on our works, ye Marvy, but do\nalways Dance a Powerful Dance.  Hail Eris!\n","power":4},{"title":"First Among Equals","id":"2423","text":"The Prime Minister is an office. The Prime Minister is elected by\nthe players of Agora primarily on account of not being the other\nperson. The Prime Minister SHOULD ensure that Agoran affairs\nproceed smoothly.\n","power":2},{"title":"Crops","id":"2708","text":"Creating and destroying types of Crop is secured.\n\nGrowing Season, Seed Cost, Growth Duration, and Sell Price are\nCrop type switches, tracked by the Land Managor, with these\nvalues:\n\n* Growing Season - all Crop Seasons\n* Seed Cost - integers from 50 to 200 inclusive, rounded\n* Growth Duration - integers from 3 to 24 inclusive, rounded\n* Sell Price - integers from 100 to 400, rounded\n\nRules to the contrary notwithstanding, a Crop type CANNOT be\nplanted while its Seed Cost is null, and CANNOT be harvested while\nits Growth Duration or Sell Price is null.\n\nWhen rounding Seed Cost or Growth Duration, ties are broken toward\nthe larger value.\n\nAn in-season Crop is one whose Growth Season is in progress. All\nothers are out-of-season.\n","power":1.0},{"title":"Decisions with Adoption Indices","id":"1950","text":"Adoption index (AI) is an untracked switch possessed by Agoran\ndecisions and proposals, secured at power 2.  For decisions, the\npossible values are \"none\" (default) or integral multiples of 0.1\nfrom 1.0 to 9.9. For proposals, the possible values are integral\nmultiples of 0.1 from 1.0 to 9.9 (default 1.0). \n\nThe adoption index of a referendum CANNOT be set or changed to\n\"none\" or to a value less than that of its associated proposal. If\na referendum ever has an adoption index of \"none\" or an adoption\nindex less than that of its associated proposal, it is immediately\nset to the adoption index of the associated proposal.\n\nAdoption index is an essential parameter of an Agoran decision if\nthat decision has an adoption index.\n\nFor any Agoran decision with a non-\"none\" adoption index, the\nvoting method is AI-majority.\n","power":3},{"title":"Extending the Voting Period","id":"2168","text":"Whenever the voting period of an Agoran decision would end, and\nthe result would be FAILED QUORUM, the length of the voting period\nfor that decision is instead increased to 14 days, except if it is\nalready that length, provided this has not already happened for\nthe decision in question.\n\nWithin four days of such an occurrence, the vote collector for the\ndecision SHALL issue a humiliating public reminder naming the\nslackers who have not yet cast any votes on it despite being\neligible players, and CAN end its voting period by announcement\n(resolving it constitutes an implicit announcement that its voting\nperiod is first ended) if the result would no longer be FAILED\nQUORUM, or if the decision is a referendum on a proposal and no\nvoter (other than possibly the proposal's author) has voted FOR.\n","power":2},{"title":"Happy Birthday","id":"1727","text":"WHEREAS, in June 1993, the world's only MUD-based nomic, Nomic\nWorld, had recently collapsed; yet, many of its players enjoyed\nnomic and did not wish to forego such a noble pursuit;\n\nAnd WHEREAS, Originator Chuck Carroll therefore composed an\nInitial Ruleset for an email nomic, based on the Initial Rulesets\nof Peter Suber, inventor of Nomic, and on the Rulesets of Nomic\nWorld and other nomics,\n\nAnd WHEREAS, a nomic thus rose like a phoenix from the ashes of\nNomic World, played on the mailing list originally set up for\ndiscussion of Nomic World, and coming into existence at June 30,\n1993, 00:04:30 GMT +1200, with a message sent by FIRST SPEAKER\nMichael Norrish, which read, in part,\n\n  \"I see no reason to let this get bogged down; there are no\n  precedents or rules that cover this situation, so I think we may\n  as well begin directly.... Proposals for new rules are invited.\n  In accordance with the rules, these will be published, numbered\n  and distributed by me at my earliest convenience.\"\n\nAnd WHEREAS, this nomic began as a humble and nameless nomic,\nknown unofficially as yoyo, after the mailing list it was played\non, until its Players, much later, gave it its OFFICIAL NAME of\nAgora,\n\nAnd WHEREAS, Agora has now become the wisest, noblest, eldest, and\nmost interesting of all active email nomics, due to the hard work\nand diligence of Agorans as well as the frequent advice of\nAgoraphobes,\n\nAnd WHEREAS, Agorans desire to joyously commemorate Agora's\nfounding,\n\nBE IT THEREFORE RESOLVED that Agora's Birthday is defined to be\nthe entire day of June 30, GMT +1200, of each year.\n","power":1},{"title":"The Archivist","id":"417","text":"The Archivist is an office; its holder is responsible for ensuring\nthe continued availability of documents of historical interest.\n\nThe archivists monthly report contains:\n  * Instructions for accessing collections of:\n    * Texts of each historic rule revision.\n    * Texts of each proposal.\n    * Judicial cases.\n    * Public messages.\n    * Messages to discussion fora.\n    * Theses for which a person was awarded a degree.\n    * Optionally, any other documents the Archivist deems worthy\n      of archival.\n  * A description of the completeness of each of the above\n    collections.\nThe referenced collections NEED NOT be perfectly complete or\naccurate, but the Archivist SHOULD work towards improving their\ncompleteness and accuracy.\n","power":1},{"title":"Fee-based Actions","id":"2579","text":"If the Rules associate payment of a set of assets (hereafter the\nfee for the action; syns: cost, price, charge) with performing an\naction, that method for performing that action is a fee-based\nmethod.\n\nIf the fee is a non-integer quantity of a currency, the actual fee\nis the next highest integer amount of that asset.\n\nTo use a fee-based method, an entity (the Actor) who is otherwise\npermitted to perform the action must announce that e is performing\nthat action; such announcement must clearly and unambiguously set\nforth intent to pay a fee for the sole purpose of using that\nmethod to perform that action. Additionally, such announcement\nmust either clearly and unambiguously specify the correct set of\nassets for that fee or use simplified wording (e.g. \"I buy X\")\nthat makes the intended fee reasonably clear and unambiguous (in\nparticular, without stating an incorrect fee).\n\nUpon such an announcement:\n\n  - If the Rules specify a recipient for the relevant fee, and the\n    Actor CAN transfer that fee from emself to the recipient, then\n    that fee is transferred from the Actor to the recipient and\n    the action is performed simultaneously;\n\n  - If the Rules do not specify a recipient, and the Actor CAN\n    destroy the relevant fee in eir possession, then that fee in\n    eir possession is destroyed and the action is performed\n    simultaneously.\n\n  - Otherwise, no changes are made to asset holdings and the\n    action is not performed.\n","power":3},{"title":"No News Is Some News","id":"2379","text":"If the rules define a report as including a list, then while that\nlist is empty, that report includes the fact that it is empty.\n","power":1},{"title":"Festival Restrictions","id":"2481","text":"While Agora's Festivity is non-zero, the following apply:\n\n1. Rules to the contrary notwithstanding, non-Festive players\n   CANNOT support/be a supporter for tabled action intents;\n\n2. Quorum for Agoran Decisions is equal to half the number of\n   Festive players, rounded up;\n\n3. Each Festive player has the maximum possible voting strength.\n   Each person who is not a Festive player has the minimum\n   possible voting strength. Rules to the contrary\n   notwithstanding, no modifications to voting strength (other\n   than defining the maximum and minimum) are applied by any other\n   Rule.\n\nWhile Agora's Festivity is zero, the paragraphs above have no\neffect and are ignored.\n","power":3.1},{"title":"Motions and Moots","id":"911","text":"The judge of a CFJ CAN by announcement self-file a Motion to\nReconsider it, if its most recent judgement has been in effect for\nless than seven days.\n\nAny player CAN with 2 support group-file a Motion to Reconsider a\ncase, if its most recent judgement had been in effect for less\nthan seven days at the time the intent was tabled.\n\nThe above notwithstanding, it is IMPOSSIBLE to file a Motion to\nReconsider a CFJ whose current judgement has been entered into\nMoot, or that has already had a Motion to Reconsider filed against\nit by the same method since it was most recently assigned to a\njudge.\n\nWhen a Motion to Reconsider a case is filed, the case is rendered\nopen again.\n\nIf a CFJ has a judgement assigned, a player CAN enter that\njudgement into Moot with N+2 support, where N is the number of\nweeks from the time the judgement was assigned to the time the\nintent was tabled, rounded down. When this occurs, the CFJ is\nsuspended, and the Arbitor is once authorized to initiate the\nAgoran decision to determine public confidence in the judgement,\nwhich e SHALL do in a timely fashion.\n\nFor this decision, the vote collector is the Arbitor and the valid\noptions are AFFIRM, REMAND, and REMIT. When the decision is\nresolved, the effect depends on the outcome:\n\n- AFFIRM, FAILED QUORUM: The judgement is reassigned to the case,\n  and cannot be entered into Moot again.\n\n- REMAND: The case becomes open again.\n\n- REMIT: The case becomes open again, and the current judge is\n  recused. The Arbitor SHALL NOT assign em to the case again\n  unless no other eligible judges have displayed interest in\n  judging.\n","power":1.7},{"title":"Switches","id":"2162","text":"A type of switch is a property that a rule or a contract defines\nas a switch (with such rule or contract being its backing\ndocument) and specifies the following:\n\n1. The type(s) of entity possessing an instance of that switch. No\n   other entity possesses an instance of that switch.\n\n2. One or more possible values for instances of that switch,\n   exactly one of which should be designated as the default. No\n   values other than those listed are possible for instances of\n   that switch, except that, if no default is otherwise\n   specified, then rules to the contrary notwithstanding, the\n   \"null\" value is a possible value for that switch, and is the\n   default.\n\nAt any given time, each instance of a switch has exactly one\npossible value for that type of switch. If an instance of a switch\ncomes to have a value, it ceases to have any other value. If an\ninstance of a switch would otherwise fail to have a possible\nvalue, it comes to have its default value. A Rule that designates\na switch as \"secured\" (at a given power level) designates changes\nto the properties of that type of switch as secured (at that power\nlevel) and designates changes to the value of each instance of the\nswitch as secured (at that power level).\n\n\"To flip an instance of a switch\" is to make it come to have a\ngiven value. \"To become X\" (where X is a possible value of\nexactly one of the subject's switches) is to flip that switch to\nX.\n\nIf a type of switch is not explicitly designated as\npossibly-indeterminate by its backing document, and if an action\nor set of actions would cause the value of an instance of that\ntype of switch to become indeterminate, that instance instead\ntakes on its last determinate and possible value, if any,\notherwise it takes on its default value.\n\nA singleton switch is a switch for which Agora Nomic is the only\nentity possessing an instance of that switch.\n\nA boolean switch is a switch with values True and False. A\npositive boolean switch has a default of True; a negative boolean\nswitch has a default of False.\n\nAttempting to flip an instance of a switch to a value it already\nhas does not flip the switch. However, if a person is REQUIRED to\nflip a switch instance to a value it already has, then either\nattempting to do so using the required mechanism, or announcing\nthat the switch already has the required value, fulfills the\nrequirement without flipping the switch.\n","power":3},{"title":"Complexity","id":"2632","text":"Complexity is a secured office switch reflecting how complex it is\nto fulfill the duties of its office. Its possible values are all\nintegers from 0 to 3 inclusive, where 1 is the default. It is\ntracked in the ADoP's weekly report. The ADoP CAN, with 2 Agoran\nconsent, flip the complexity of an office to a specified possible\nvalue.\n\nFor each office a player holds, eir voting strength is increased\nby the complexity of the office for referenda on ordinary\nproposals, up to a maximum increase of 3 by this method.\n","power":2.0},{"title":"Eclipse Light","id":"2614","text":"An emergency message is one whose subject line contains the text\n\"[Emergency]\".\n\nThe Prime Minister CAN, in an emergency message and with 3 Agoran\nconsent, enact, amend, or repeal Emergency Regulations, provided\nthat the intent to do so was also contained in an emergency\nmessage. To the extent explicitly permitted by this rule,\nEmergency regulations are always taking effect.\n\nEmergency Regulations CAN, as part of their effect:\n  - Extend any deadline provided for by any instrument other than\n    this rule, including a deadline for an obligation to be met,\n    or deadline prior to which an action must be performed in\n    order to be valid, such as the end of voting period. Such an\n    extension CANNOT cause the total time period, such as the\n    time from when an obligation was created to the deadline or\n    the whole of a voting period, to be more than double its\n    original length.\n  - Create, destroy, or transfer assets, or require or forbid\n    their creation, destruction, or transfer.\n  - Collectively, exercise Mint Authority\n  - Cause one or more players to win Agora.\n  - Appoint or remove officeholders, other than Prime Minister or\n    Speaker.\n  - Modify the Festivity.\n  - Award Patent Titles that are either Badges or are not\n    mentioned in any Rule.\n  - Modify the Publicity of Fora.\n\nThe Prime Minister CAN, in an emergency message and with 4 Agoran\nConsent, provided that the intent to do so was also contained in\nan emergency message, Extend the Emergency.\n\nIf there is an Emergency Regulation that has existed for at least\na month and the Prime Minister has not Extended the Emergency in\nthe past month, any player CAN, with 7 days notice, repeal all\nEmergency Regulations.\n\nIf the Prime Minister has not sent a message to a public forum in\nthe preceding four days, the Speaker CAN exercise eir powers under\nthis rule as if e were the Prime Minister, and notwithstanding any\nrule that would prohibit a single player from holding both\noffices.\n\nRules to the contrary notwithstanding, Emergency Regulations\nCANNOT be enacted, amended, or repealed except as described in\nthis Rule, nor can an entity that is not an Emergency Regulation\nbe made to become an Emergency Regulation except as described in\nthis rule.\n","power":3.1},{"title":"Proposal Recycling","id":"2625","text":"If a referendum on a proposal was resolved as FAILED QUORUM in the\npast seven days, the Promotor CAN once recycle the proposal by\nannouncement, adding it to the Proposal Pool and causing it to\nbecome pended.\n","power":1.0},{"title":"Bleach","id":"2429","text":"Replacing a non-zero amount of whitespace with a different\nnon-zero amount of whitespace is generally insignificant, except\nif doing so substantially changes the semantic, logical, or\nartistic structure of the text.\n","power":1},{"title":"Default Recordkeepors","id":"2603","text":"For each type of switch or asset that is not defined as untracked\nand that has at least one instance that would otherwise lack a\nrecordkeepor, there exists an imposed office named \"Tracker of\n[type name]\" whose holder tracks those instances.\n","power":1},{"title":"Self-Ratification","id":"2201","text":"When a public document published less than 180 days ago is first\ncontinuously undoubted for two weeks after publication:\n\n- If the rules define it as self-ratifying, it is ratified.\n\n- If the rules define it as a self-ratifying attestation to a\n  given statement, the statement is ratified, with the publication\n  time being the instant at which the document was published.\n\n  This clause is inapplicable if the statement to be ratified\n  cannot be reasonably ascertained from the ruleset and the\n  contents of the message.\n\nThe definition of documents as self-ratifying and the definition\nof documents as self-ratifying attestations are secured at power\n3.\n\nAny person CAN by announcement issue a doubt (syn. claim of\nerror), identifying a public document published less than 180 days\nago and explaining the scope and nature of a perceived error in it\n(or in a statement it attests to).\n\nWhen this happens, the publisher of the original document SHALL\n(if e was required to publish that document) or SHOULD (otherwise)\ndo one of the following in a timely fashion, in an announcement\nthat clearly cites the claim of error:\n\n   1. Deny the claim (causing it to cease to be a doubt).\n\n   2. Publish a revision.\n\n   3. Initiate an inquiry case regarding the truth of the claim\n      (if the subject is actually a matter of law), or cite a\n      relevant existing inquiry case.\n\nThe issuance of a doubt on a documents, the denial of a claim of\nerror, and the ceasing of a doubt on a document to be a doubt are\nsecured at power 3.\n","power":3},{"title":"Order of the Hero of Agora Nomic","id":"2231","text":"Heroic titles are Agora's premier patent titles of distinction,\nand CAN be awarded to persons for meritorious service only by a\nproposal of power 3 or greater, which SHOULD explain why those\npersons are qualified. Bearers of heroic titles (Heroes)\nconstitute the Order of the Hero of Agora Nomic.\n\nThe Heroic titles in decreasing precedence are:\n\nGrand Hero of Agora Nomic (GHAN) -- This title may be awarded to\nany person obviously and directly responsible for the existence of\nAgora and/or Nomic in general. As this title is the highest honour\nthat Agora may bestow, a Bearer of this title OUGHT to be treated\nright good forever.\n\nHero of Agora Nomic (HAN) -- This title may be awarded to any\nperson for outstanding meritorious service to Agora above and\nbeyond the call of duty.\n","power":3},{"title":"The Royal Parade","id":"2486","text":"              _\n            _\\ /_\n            >_X_<\n     .---._  /_\\  _.---.\n   /`.---._`{/ \\}`_.---.`\\\n  | /   ___`{\\_/}`___   \\ |\n  \\ \\.\"`*  `\"{_}\"`  *`\"./ /\n   \\ \\  )\\  _\\ /_  /(  / /\n    \\ *<()( >_X_< )()>* /\n     |._)/._./_\\._.\\(_.|\njgs  |() () () () () ()|\n     <<o>><<o>><o>><<o>>\n    `\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"`\n     IN CELEBRATION of Alexis being crowned Princess of Agora,\n          without prejudice to Any before or since\n          who may come to hold a Title\n          whether Patent or otherwise;\n    IT IS HEREBY PROCLAIMED that a Royal Parade be established,\n          imbued in this very Rule,\n          which shall travel around Agora to Rules of import;\n    AND THEREFORE, the Rulekeepor SHOULD place this Rule\n          near recently-amended rules of high Power;\n    AND FURTHERMORE, additions to this Parade are most welcome\n         when Events suiting the honour should occur.\n    NEXT UP in the Parade comes the Discordian Court:  G. the\n         Grand Vizier is arguing with Janet the Untitled, while\n         nix, Court Anarchist, is cramming cancelled ballots into\n         eir pockets.\n","power":3.14},{"title":"Delivering Judgements","id":"591","text":"When a CFJ is open and assigned to a judge, that judge CAN assign\na valid judgement to it by announcement, and SHALL do so in an\nofficially timely fashion after this becomes possible.\n\nThe valid judgements for an inquiry case are as follows, based on\nthe facts and legal situation at the time the inquiry case was\ninitiated, not taking into account any events since that time:\n\n* FALSE, appropriate if the statement was factually and\n  logically false.\n\n* TRUE, appropriate if the statement was factually and\n  logically true.\n\n* IRRELEVANT, appropriate if the veracity of the statement is\n  not relevant to the game or is an overly hypothetical\n  extrapolation of the game or its rules to conditions that don't\n  actually exist, or if it can be trivially determined from the\n  outcome of another (possibly still undecided) judicial case that\n  was not itself judged IRRELEVANT.\n\n* INSUFFICIENT, appropriate if the statement does not come\n  with supporting arguments or evidence, and the judge feels as if\n  an undue burden is being placed on em by the lack of arguments\n  and evidence. A CFJ judged as INSUFFICIENT SHOULD be submitted\n  again with sufficient arguments/evidence.\n\n* DISMISS, appropriate if the statement is malformed, undecidable,\n  if insufficient information exists to make a judgement with\n  reasonable effort, or the statement is otherwise not able to be\n  answered with another valid judgement. DISMISS is not\n  appropriate if PARADOXICAL is appropriate.\n\n* PARADOXICAL, appropriate if the statement is logically\n  undecidable as a result of a paradox or or other irresolvable\n  logical situation. PARADOXICAL is not appropriate if IRRELEVANT\n  is appropriate, nor is it appropriate if the undecidability\n  arises from the case itself or in reference to it.\n\nIf the judge of an open CFJ has not violated a time limit for\nassigning it a judgement, and has not previously filed a motion to\neither extend or reconsider the case, e CAN file a motion to\nextend the case by announcement. Doing so extends eir judgement\ndeadline for that case by one week. In doing so, e SHOULD include\na (nonbinding) draft or outline of eir current thoughts on the\ncase.\n","power":1.7},{"title":"Acting on Behalf","id":"2466","text":"When a rule allows one person (the agent) to act on behalf of\nanother (the principal) to perform an action, that agent CAN\nperform the action if it is POSSIBLE for the principal to do so,\ntaking into account any prerequisites for the action. If the\nenabling rule does not specify the mechanism by which the agent\nmay do so, then the agent CAN perform the action in the same\nmanner in which the principal CAN do so, with the additional\nrequirement that the agent must, in the message in which the\naction is performed, uniquely identify the principal and that the\naction is being taken on behalf of that person.\n\nA person SHALL NOT act on behalf of another person if doing so\ncauses the second person to violate the rules. A person CANNOT act\non behalf of another person to do anything except perform a game\naction; in particular, a person CANNOT act on behalf of another\nperson to send a message, only to perform specific actions that\nmight be taken within a message, including actions that would\notherwise be taken by publishing certain text.\n\nWhen an action is performed on behalf of a principal, then the\naction is considered for all game purposes to have been performed\nby the principal, unless a rule specifically states that it is\ntreated differently for some purpose, in which case it is treated\nas described by that rule.\n\nAllowing a person to act on behalf of another person is secured at\npower 2.0. This rule takes precedence over any rule that would\nprohibit a person from taking an action, except that it defers to\nany rule that imposes limitations specifically on actions taken on\nbehalf of another person.\n\nAn agent CANNOT act on behalf of a principal to perform an action\nvia a specific method if the rules state that the actor acts \"as\nemself\" or \"on eir own behalf\" to perform the action via that\nmethod.\n","power":3},{"title":"Regulating Agoran Bingo","id":"2703","text":"The Collar SHOULD try to enact and maintain administrative\nregulations defining:\n\n* one or more methods for a player to select a bingo board;\n\n* the conditions that can be included on a player's bingo board;\n  and\n\n* one or more winning bingo patterns\n\nThe methods for selecting a bingo board SHOULD be such that:\n\n* there is at least one method that permits a player to keep eir\n  bingo board secret until e calls bingo;\n\n* a player cannot change eir selection once made; and\n\n* a player cannot choose in advance with certainty the board e\n  will end up with\n\nAdditionally, for each method of selecting a bingo board, the\nCollar's regulations SHOULD specifiy:\n\n* what information, if any, a player electing that method MUST\n  reveal in order to successfully call bingo; and\n\n* what information, if any, the Collar MUST include in eir weekly\n  report for each player electing that method\n","power":1.0},{"title":"Ratification","id":"1551","text":"A retroactive change is one that changes the game's record of past\nevents. Retroactive changes are secured with power threshold 3.\n\nWhen a document or statement (hereafter \"document\") is to be\nratified, the following definitions apply:\n* The publication time can be specified by the instrument allowing\n  the ratification, defaulting to the instant at which the\n  document to be ratified was published.\n* The truth time is the instant at which the document specifies\n  that it was true, or the publication time if such an instant is\n  not specified.\n* The application time is the instant at which the document to be\n  ratified is ratified.\n\nRatification CANNOT occur if the truth time would be after the\napplication time, or if the publication time would be after the\napplication time.\n\nRules to the contrary notwithstanding, when a document is\nratified, the gamestate is modified to what it would be if, at the\ntruth time, the gamestate had been minimally modified to make the\nratified document as true and accurate as possible.\n\nRatification CANNOT occur if it would add inconsistencies between\nthe gamestate and the rules.\n\nRatification CANNOT occur if the required modification to the\ngamestate is not possible or if multiple substantially distinct\npossible modifications would be equally appropriate.\n\nIf the minimal modification would include past or present rule\nchanges, they are instead excluded unless the ratified document\nexplicitly and unambiguously recites either the changes or the\nresulting properties of the rule(s).\n\nAn internally inconsistent document generally CANNOT be ratified;\nhowever, if such a document can be divided into a summary section\nand a main section, where the only purpose of the summary section\nis to summarize information in the main section, and the main\nsection is internally consistent, ratification of the document\nproceeds as if it contained only the main section.\n\nText purportedly about previous instances of ratification (e.g. a\nreport's date of last ratification) is excluded from ratification.\nThe rules may define additional information that is considered to\nbe part of the document for the purposes of ratification; such\ndefinitions are secured with power threshold 3.\n\nRatification is secured with power threshold 3.\n","power":3.2},{"title":"The Distributor","id":"2575","text":"The Distributor is an imposed office whose holder is generally\nresponsible for the management of the primary Agoran fora. The\nholder CANNOT be changed except without objection or by proposal.\nRules to the contrary notwithstanding, the Distributor CANNOT\nderegister or be deregistered.\n","power":3},{"title":"Patent Titles","id":"649","text":"A Patent Title is a legal title held by an entity in recognition\nof eir distinction. The Herald is an office; its holder is\nresponsible for tracking Patent Titles in eir monthly report.\n\nAwarding or revoking a Patent Title is secured at power 1. A\nperson permitted and enabled to award (revoke) a Patent Title\nSHALL do so in a timely fashion after the conditions authorizing\nem to do so are announced, unless there is an open judicial case\ncontesting the validity of those conditions.\n\nThe Herald CAN award a specified Patent Title to a specified\nplayer with 2 Agoran consent. Any player CAN award a specified\nPatent Title to a specified player, as authorized by the Herald's\nAdministrative Regulations.\n","power":1.5},{"title":"Defendant's Rights","id":"2531","text":"An infraction is automatically forgiven if:\n\n(1) the alleged infracter can't be established by a preponderance\n    of the evidence to have committed the infraction;\n\n(2) at the time the alleged infraction occurred, it was not an\n    infraction;\n\n(3) the infraction was for failure to take an action that the\n    infracter, through no fault of eir own, COULD NOT have\n    performed;\n\n(4) the infraction is for conduct that the infracter, through no\n    fault of eir own, was obliged to undertake by a rule of equal\n    or greater power to the one e violated;\n\n(5) the infracter could not have avoided the infraction when\n    exercising the highest reasonably possible standard of care;\n    or\n\n(6) any available non-null punishment would be blatantly and\n    obviously unsuited to the conduct which constitutes the\n    infraction or to the person who committed the infraction.\n\nRules to the contrary notwithstanding, any attempt to investigate\nan infraction which would result in the creation of blots is\nINEFFECTIVE if:\n\n(1) it does not include the specific reason for the fine; or\n\n(2) it would result in a punishment that is blatantly and\n    obviously unsuited to the conduct which constitutes the\n    infraction or to the person who committed the infraction.\n","power":2},{"title":"Rule Changes","id":"105","text":"When the rules provide that an instrument takes effect, it can\ngenerally:\n\n1. enact a rule. The new rule has power equal to the minimum of\n   the power specified by the enacting instrument, defaulting to\n   one if the enacting instrument does not specify or if it\n   specifies a power less than 0.1, and the maximum power\n   permitted by other rules. The enacting instrument may specify a\n   title for the new rule, which if present shall prevail. The ID\n   number of the new rule cannot be specified by the enacting\n   instrument; any attempt to so specify is null and void.\n\n2. repeal a rule. When a rule is repealed, it ceases to be a rule,\n   its power is set to 0, and the Rulekeepor need no longer\n   maintain a record of it.\n\n3. reenact a rule. A repealed rule identified by its most recent\n   rule number MUST be reenacted with the same ID number. If no\n   text is specified, the rule is reenacted with the same text it\n   had when it was most recently repealed. If the reenacting\n   proposal provides new text for the rule, the rule SHOULD have\n   materially the same purpose as did the repealed version. Unless\n   specified otherwise by the reenacting instrument, a reenacted\n   rule has power equal to the power it had at the time of its\n   repeal (or power 1, if power was not defined at the time of\n   that rule's repeal). If the reenacting instrument is incapable\n   of setting the reenacted rule's power to that value, then the\n   reenactment is null and void.\n\n4. amend the text of a rule.\n\n5. retitle a rule.\n\n6. change the power of a rule.\n\nA rule change is any effect that falls into the above classes.\nRule changes always occur sequentially, never simultaneously. If a\nspecification would ever be interpreted as causing multiple\nchanges to happen at once, it is instead interpreted as attempting\nto cause them to occur separately, in the order they are listed in\nthe specification.\n\nAny ambiguity in the specification of a rule change causes that\nchange to be void and without effect. An inconsequential variation\nin the quotation of an existing rule does not constitute ambiguity\nfor the purposes of this rule. Furthermore, if the change being\nspecified would be clear to any reasonable player, the\nspecification is not ambiguous, even if it is incorrect or unclear\non its face. This provision does not prevent the specification of\nundesirable changes; for instance, an amendment which adds a typo\nis not corrected to remove the typo.\n\nA rule change is wholly prevented from taking effect unless its\nfull text was published, along with an unambiguous and clear\nspecification of the method to be used for changing the rule, at\nleast 4 days and no more than 60 days before it would otherwise\ntake effect.\n\nThis rule provides the only mechanism by which rules can be\ncreated, modified, or destroyed, or by which an entity can become\na rule or cease to be a rule.\n","power":3},{"title":"Agoran Decisions","id":"693","text":"When the rules call for an Agoran decision to be made, the\ndecision-making process takes place in the following three\nstages, each described elsewhere:\n\n1. Initiation of the decision.\n\n2. Voting of the people.\n\n3. Resolution of the decision.\n","power":3},{"title":"Spendies","id":"2690","text":"The Spendor is an office.\n\nSpendies are a currency ownable by players and contracts. Spendies\nare tracked by the Spendor in eir weekly report. If the Spendor's\nreport is overdue, then other players SHOULD deputise to publish\nit.\n\nAt the end of each month, all Spendies are destroyed. At the\nbeginning of each month, every player is granted 20 Spendies.\n","power":1.0},{"title":"Radiance","id":"2656","text":"The Illuminator is an office, responsible for tracking radiance.\n\nA player's Radiance is an integer player switch defaulting to 0,\ntracked by the Illuminator. When a player is \"granted\" or \"gains\"\na specified amount of radiance, eir radiance is increased by that\namount.\n\nUpon a correct announcement from a player that eir radiance is 100\nor more (correctly specifying the amount), e Outshines the Sun.\n\nWhen a player Outshines the Sun, e wins the game. When a player\nwins the game this way, the following happen in order:\n\n* Eir radiance is set to 0.\n\n* The radiance of each other player is set to half its current\n  value (rounded down).\n\nOnce per quarter, the Illuminator CAN by announcement (and SHALL\nduring its first Eastman week) issue a Notice of Diminution, upon\nwhich all radiance switches are set to half their current value\nrounded down.\n\nAny player CAN increase eir radiance by 1 by paying a fee of 2\nSpendies.\n","power":1.5},{"title":"Cantus Cygneus","id":"1789","text":"Whenever a Player feels that e has been treated so egregiously by\nthe Agoran community that e can no longer abide to be a part of\nit, e may submit a document to the Registrar, clearly labeled a\nCantus Cygneus, detailing eir grievances and expressing eir\nreproach for those who e feels have treated em so badly.\n\nIn a timely fashion after receiving a Cantus Cygneus, the\nRegistrar shall publish this document along with a Writ of\nFugiendae Agorae Grandissima Exprobratione, commanding the Player\nto be deregistered. The Registrar shall note the method of\nderegistration for that Player in subsequent Registrar monthly\nReports.\n\nThe Player is deregistered as of the posting of the Writ, and the\nnotation in the Registrar's monthly report will ensure that,\nhenceforth, all may know said Player deregistered in a Writ of\nFAGE.\n","power":3},{"title":"Expectations of Participation","id":"2678","text":"An \"Agoran forum\" is a forum with publicity of discussion or\npublic. Players of Agora have the following expectations of Agoran\nfora:\n\n* Agoran fora allow equal participation for all players, subject\n  to the rules of Agora and the explicitly stated rules of the\n  fora.\n\n* The rules of participation in public fora are as closely aligned\n  with the rules of Agora itself as possible; a player expects to\n  be able to fully participate in all public fora as long as eir\n  participation is in line with Agora's rules.\n\n* Agoran fora allow all interested persons, even those that are\n  otherwise restricted in eir participation, to read all messages.\n\n* Discussion fora moderators may restrict participation subject to\n  eir own clearly stated rules but should only do so to players\n  temporarily and proportional to the harm of the rule breakage.\n\n* The content of discussion fora should primarily be about Agora\n  itself, or reasonably adjacent topics.\n\nIf an existing Agoran forum is in violation of these expectations,\nthe Agoran community, led by the Registrar, SHOULD remove it or\nreplace it with an appropriate forum as soon as possible.\n","power":3},{"title":"Annual Awards","id":"2582","text":"April is hereby designated Awards Month.\n\n\nThe following Patent Titles CAN be awarded by the indicated\nOfficers with 2 Agoran consent. The Patent Titles SHOULD be\nawarded during Awards Month, and the award SHOULD be made to\ncommemorate acts performed in the previous Agoran year. The full\nname of each awarded Patent Title is [Title Below] NNNN, where\nNNNN is the year each act was performed.\n\nThe Herald SHALL announce it is Awards Month in an officially\ntimely fashion after it begins. E SHOULD petition officers to\naward their awards if they have not done so by the end of Awards\nMonth.\n\nEach indicated Officer SHOULD award these titles to 1-2 persons\neach year, and SHOULD solicit an open call for nominations and\ndiscussion before making these awards. The Herald SHALL note any\nadditional information indicated below as part of eir report of\nPatent Titles.\n\n - Silver Quill, awardable by the Promotor to the author of a\n   proposal of outstanding merit and influence on the game, or to\n   a coauthor, although e SHOULD only do so if it is generally\n   agreed that that coauthor contributed more to that proposal\n   than the person who submitted it (additional information: ID\n   number of the proposal).\n\n - Wooden Gavel, awardable by the Arbitor to the judge of a CFJ\n   or series of CFJs with a strong and foundational impact on the\n   judicial precedents of Agora (additional information: ID\n   numbers of the judgements).\n\n - Golden Glove, awardable by the Tailor to the player who made\n   the most interesting, successful, and/or competitive series of\n   moves while attempting to win or get substantially ahead in\n   the game.\n\n - Employee of the Year, awardable by the ADoP to the persons\n   who put the most persistent hard labor into keeping the game\n   going through the performance of Officers' duties (additional\n   information: offices held by the awardee during that year).\n","power":1},{"title":"Light Overexposure","id":"2711","text":"When a player wins the game as a result of Outshining the Sun, the\nfollowing happen in order:\n\n* All Pyrite is destroyed.\n\n* The Fields Wither.\n\n* All Hectares are destroyed.\n\n* Each player is granted 16 Hectares.\n","power":1.0},{"title":"Regulations","id":"2493","text":"A regulation is a textual entity defined as such by a Rule (its\nparent rule) and existing solely because that Rule defines its\nexistence. A regulation has no effect other than those that the\nRules explicitly give it.\n\nA regulation CAN be enacted, amended, and repealed as specified by\nits parent rule. Regulations are tracked by the Rulekeepor as part\nof eir monthly report in a fashion similar to rules.\n","power":3},{"title":"Badges","id":"2415","text":"A Badge is any patent title with the word 'badge' as part of its\nname. A badge SHOULD be used to award multiple persons for\nparticipating in specific event of note within Agora.  Any player\nCAN award a badge that does not yet exist to three or more persons\nsimultaneously, with Agoran consent. The Herald CAN award an\nexisting badge to persons without objection.\n","power":1.5},{"title":"Adopting Proposals","id":"106","text":"When a referendum on a proposal is resolved, if the outcome is\nADOPTED, then the proposal in question is adopted, its power is\nset to the minimum of four, the adoption index of the proposal,\nand the adoption index of the referendum, and it takes effect.\nProposals CANNOT otherwise be adopted or take effect, rules to the\ncontrary notwithstanding.\n\nWhen a proposal takes effect, the proposal applies the changes\nthat it specifies in its text, except as prohibited by other\nrules. Unless otherwise specified by the text, the effects are\napplied in the order they appear in the text. Clearly marked\ncomments are ignored. If the proposal cannot make some changes it\nspecifies, that does not preclude the other changes from taking\nplace.\n\nExcept insofar as the actions performed by a proposal happen one\nafter another, rather than simultaneously, a proposal's effect is\ninstantaneous. A proposal can neither delay nor extend its own\neffect.  Once a proposal finishes taking effect, its power is set\nto 0.\n\nNo entity with power below the power of this rule can prevent a\nproposal from taking effect; this does not apply to generally\npreventing changes to specified areas of the gamestate, nor to a\nproposal preventing itself from taking effect (its no-effect\nclause is generally interpreted as applying only to the rest of\nthe proposal).\n","power":3},{"title":"Free Tournaments","id":"2566","text":"A player who is not the gamemaster of an existing tournament CAN\ninitiate a sanctioned tournament with a specified set of\nregulations with 2 Agoran consent. A tournament created using this\nmethod is called a Free Tournament.\n\nA free tournament CAN be concluded with no winner without 3\nobjections. Tournaments SHOULD only be concluded in this manner if\nit is clear that its regulations are malformed or contrary to the\ntournament's intent or that it is IMPOSSIBLE for any player to win\nthe tournament.\n","power":1},{"title":"Tabled Actions","id":"1728","text":"An action is a Tabled Action if the Rules purport to authorize its\nperformance via one of the following methods:\n* With N Support, where N is a positive integer.\n* Without N Objections, where N is a positive integer.\n* With N Agoran Consent, where N is a positive integer multiple of\n  0.1.\n* With T notice, where T is a time period.\n\nThe parameters N and T, if omitted, default to 1 and 4 days,\nrespectively (e.g. \"without objection\" means N=1). If a rule\ndefines N as less than 1, it is instead treated as 1.\n\nA person, acting as emself, CAN by announcement table an intent\n(syn.  \"intend\") to perform a tabled action, clearly,\nconspicuously, explicitly, and without obfuscation specifying the\naction, the method (including non-default parameter values), and,\noptionally, conditions.\n\nA person is the sponsor of such an intent if e tabled it, or if e\nis authorized to perform its action due to holding a rule-defined\nposition previously held by the person who tabled it.\n","power":3},{"title":"Ribbons","id":"2438","text":"The Tailor is an office, and the recordkeepor of Ribbons.\n\nFor each type of Ribbon, <type> Ribbon Ownership is a secured\nnegative boolean person switch, tracked by the Tailor in eir\nmonthly report. Laudability is a secured person switch with\nnon-negative integer possible values, defaulting to 0, tracked by\nthe Tailor as part of eir monthly report. When a person owns more\ntypes of ribbons than eir Laudability, eir Laudability is set to\nthe number of types of ribbons e owns.\n\nTo \"award a person a <Ribbon type>\" is to flip that person's\n<that type> Ribbon Ownership to True. A person \"owns a <Ribbon\ntype>\" if eir <that type> Ribbon Ownership is True.\n\nA person qualifies for a type of Ribbon if e has earned that type\nof Ribbon within the preceding 7 days (including earlier in the\nsame message).\n\nWhile a person owns all types of Ribbon, that person can Raise a\nBanner by announcement. This causes that person to win the game.\nWhen a person wins this way, for each type of Ribbon, that\nperson's <type> Ribbon Ownership is flipped to False.\n\nThe types of Ribbon, and the methods of obtaining them, are as\nfollows:\n\nRed (R): When a proposal is adopted and changes at least one rule\nthat, immediately before or after the change, has Power >= 3, its\nproposer earns a Red Ribbon.\n\nOrange (O): When a proposal is adopted via a referendum on which\nno valid ballots were AGAINST (after evaluating conditionals), its\nproposer earns an Orange Ribbon.\n\nGreen (G): While a person holds a voluntary office, has done so\ncontinuously for the past 30 days, and has not failed to perform\nany duties of that office within the appropriate time limits\nduring those 30 days, that person qualifies for a Green Ribbon.\n\nEmerald (E): When a person wins an election, e earns an Emerald\nRibbon.\n\nCyan (C): When a person deputises for an office or is the delegate\nfor an office while its holder is on vacation, and that person has\nnot held or deputised for that office within the past 7 days, that\nperson earns a Cyan Ribbon.\n\nBlue (B): When a person assigns a judgement to a CFJ, and has\nnever violated a time limit to assign a judgement to that CFJ,\nnor ever self-filed a motion to reconsider that CFJ, that person\nearns a Blue Ribbon.\n\nMagenta (M): When, during Agora's Birthday, a person publicly\nacknowledges it, that person earns a Magenta Ribbon.\n\nUltraviolet (U): When a person is awarded the Patent Title\nChampion, that person earns an Ultraviolet Ribbon, unless the\nChampion title was awarded as the result of winning the game via\nthis rule.\n\nViolet (V): When a person is awarded a Patent Title other than\nChampion or a degree, that person earns a Violet Ribbon.\n\nIndigo (I): When a person is awarded a degree, that person earns\nan Indigo Ribbon.\n\nPlatinum (P): The Speaker qualifies for a Platinum Ribbon.\n\nLime (L): A person qualifies for a Lime Ribbon if three or more\nproposals adopted in the preceding 7 days had that person as a\ncoauthor.\n\nWhite (W): A player qualifies for a White Ribbon if e has never\npreviously owned a White Ribbon (including under previous\nrulesets). A player who has been registered for the past 30+ days\nor 180+ cumulative days and has never acted on eir own behalf to\ncause another person to gain a White Ribbon (including under a\nprevious ruleset) CAN act on eir own behalf to cause another\nperson to earn a White Ribbon by announcement.\n\nBlack (K): An instrument CAN, as part of its effect, cause a\nperson to earn a Black Ribbon.\n\nGray (A): Once per month the Tailor CAN, by announcement, cause a\nspecified player to earn a Gray Ribbon. E is ENCOURAGED to do so\nbefore publishing eir monthly report.\n\nTransparent (T): A person qualifies for a Transparent Ribbon while\nthe number of other types of Ribbon that that person qualified for\nwithin the previous 7 days is at least 5.\n\nWhen a person earns a White, Black or Gray Ribbon, this Rule\nawards that person a Ribbon of that type.\n\nWhile a person qualifies for a type of Ribbon:\n\n  - If e has not owned that type of Ribbon within the preceding 7\n    days, any player CAN, by announcement, award em that type of\n    Ribbon.\n\nQualifying for ribbons is secured. Earning ribbons is secured.\n","power":3},{"title":"Random Choices","id":"2505","text":"When a Rule specifies that a random choice be made, then the\nchoice shall be made using whatever probability distribution among\nthe possible outcomes the Rule specifies, defaulting to a uniform\nprobability distribution.\n\nThe choice can be made using any physical or computational process\nwhose probability distribution among the possible outcomes is\nreasonably close to that required by the Rules, and for which the\nfinal choice is not trivially predictable by the selecting person\nin advance. The selecting person SHOULD make the selection method\npublic, and SHOULD use a method for which the final probability\ndistribution can be readily confirmed.\n","power":1},{"title":"The Administrative State","id":"2630","text":"Each officer CAN, with 1.5 Agoran consent, enact, amend, or repeal\neir own office's Administrative Regulations. If e has won an\nelection for the office in the past 7 days, e CAN repeal them by\nannouncement.  Administrative Regulations have the following\nproperties:\n\n1. An officer SHALL NOT violate requirements in eir office's\n   administrative regulations clearly intended to be punishable as\n   rules violations in the discharge of eir office.\n2. Any player CAN act on behalf of an officer to exercise eir\n   official powers as authorized by eir office's administrative\n   regulations.\n3. All players SHOULD abide by an officer's administrative\n   regulations in matters relating to eir area of responsibility.\n","power":2.0},{"title":"Hectares","id":"2704","text":"Hectare is a type of fixed currency, tracked by the Land Managor.\n\nA player CAN pay a fee of 500 Pyrite to gain 1 Hectare.\n","power":1.0},{"title":"Agoran Time","id":"1023","text":"The following terms are defined:\n\n1. The phrase \"in a timely fashion\" means \"within 7 days\". This\n   time period is set when the requirement is created (i.e. X days\n   before the limit ends). A requirement to perform an action at\n   an exact instant (e.g. \"when X, Y SHALL Z\"), but not \"in the\n   same message\", is instead interpreted as a requirement to\n   perform that action in a timely fashion after that instant.\n2. The phrase \"in an officially timely fashion\" means \"before the\n   end of the next Agoran week\". This time period is set when the\n   requirement is created (i.e. between 7 and 14 days before the\n   period ends).\n3. Agoran epochs:\n   a. Agoran days begin at midnight UTC.\n   b. Agoran weeks begin at midnight UTC on Monday. Eastman weeks\n      begin at midnight UTC on the 1st, 8th, 15th, 22nd, and 29th\n      of each Gregorian month; the fifth one of the month (if any)\n      lasts till the end of the month.\n   c. Agoran months begin at midnight UTC on the first day of each\n      Gregorian month.\n   d. Agoran quarters begin when the Agoran months of January,\n      April, July, and October begin.\n   e. Agoran years begin when the Agoran month of January begins.\n   f. A pivot is either the instant at which Agora Nomic began\n      (June 30, 1993, 00:04:30 GMT +1200) or an instant at which\n      at least one person won the game. When used as a period of\n      time, a \"Round\" (historical syn: \"game\") is the period of\n      time between a pivot and the next pivot.\n   The \"Agoran\" qualifier is assumed unless a different definition\n   is indicated (e.g. Eastman weeks). These definitions do not\n   apply to relative durations (e.g. \"within <number> days after\n   <event>\").\n4. Two points in time are within a month of each other if:\n   a. they occur in the same Agoran month;\n   b. they occur in two consecutive Agoran months, and the later\n      of the two occurs in an earlier day in the month than the\n      earlier one;\n   c. they occur in two consecutive Agoran months on the same day\n      of the month, and the later of the two occurs at the same or\n      earlier time of day.\n5. Any anniversary, monthly anniversary, or quarterly anniversary\n   that would otherwise attempt to occur on a day of the month\n   that does not exist (after considering any leap day) instead\n   occurs on the first day of the following month.\n","power":2},{"title":"The Game of Agora","id":"101","text":"Agora is a game of Nomic, wherein Persons, acting in accordance\nwith the Rules, communicate their game Actions and/or results of\nthese actions via Fora in order to play the game. The game may be\nwon, but the game never ends.\n\nPlease treat Agora Right Good Forever.\n","power":4},{"title":"Asset Actions","id":"2577","text":"An asset generally CAN be destroyed by its owner by announcement,\nsubject to modification by its backing document. Attempts to\ndestroy no assets are successful. An indestructible asset is one\ndefined as such by its backing document, and CANNOT be destroyed\nexcept as explicitly specified by its backing document; any other\nasset is destructible.\n\nFor an entity to gain (historical syn. earn) an asset is for that\nasset to be created in that entity's possession. To grant an\nentity an asset is to create it in eir possession. To grant an\nentity a set of assets is to create each asset in the set in eir\npossession.\n\nFor an entity to lose an asset is for that asset to be destroyed\nfrom that entity's possession. To revoke an asset from an entity\nis to destroy it from that entity's possession.\n\nFor entity A to take an asset from entity B is to transfer it from\nentity B to entity A.\n\nAn asset generally CAN be transferred (syn. given) by announcement\nby its owner to another entity, subject to modification by its\nbacking document. Attempts to transfer no assets are successful. A\nfixed asset is one defined as such by its backing document, and\nCANNOT be transferred except as explicitly specified by its\nbacking document; any other asset is liquid.\n\nWhen a rule indicates creating, destroying, or transferring an\namount of assets that is not a natural number, the specified\namount is rounded up to the nearest natural number after all other\ncalculations.\n","power":3},{"title":"Holidays","id":"1769","text":"The period each year from midnight GMT on the morning of 24\nDecember to the beginning of the first Agoran week to begin after\n2 January is a Holiday.\n\nThe week that contains the beginning of Agora's Birthday,\ntogether with the following week, is a Holiday.\n\nIf a person breaks a Rule by missing a deadline that occurs during\na Holiday, punishment is generally not appropriate.\n","power":3}],"enacted_rules":["101","1698","869","478","2139","1789","2646","2678","2679","2152","2509","2125","1023","1728","2124","2518","2505","2681","1586","2162","1688","2140","2350","2625","2606","1607","2137","106","2141","217","1030","2240","105","2493","2486","1051","1681","2221","2429","2614","693","107","2528","683","208","955","879","2422","2127","2168","1950","2034","1006","2630","2651","2154","2573","2160","2689","2691","2138","2472","2143","2677","2667","2632","2603","2379","2698","2616","417","1551","2202","2201","2555","2556","2478","2676","2531","991","591","911","2175","2492","2246","2471","2450","2466","2618","2519","1742","2608","2166","2576","2577","2578","2579","2659","2701","2499","2585","2690","2699","2656","2704","2705","2706","2707","2708","2709","2710","2711","2712","2713","2714","2449","2465","2553","2438","2480","2481","649","2415","1367","2231","2581","2582","103","104","2423","2463","2451","2575","2327","2686","1727","2464","2566","2495","1769","2029","2694","2683","2695","2702","2703"],"category_names":{"The Game of Agora":{"name":"The Game of Agora","description":"This section includes a few rules concerning the Nature of the Game\nof Agora."},"Players":{"name":"Players","description":"This small section provides some rules detailing how joining and\nleaving Agora works. If you're a new player, this is probably the\nmost important section to read."},"General Definitions":{"name":"General Definitions","description":"This section describes the terminology used by all the other rules.\nIf, when reading a rule, you don't understand what a word means,\nchances are that the Agoran definition of that word is described in\none of these rules."},"Entities":{"name":"Entities","description":"\"Entity\" is a confusing word to new players. This section describes\nwhat an entity is."},"Proposals":{"name":"Proposals","description":"Proposals are a staple of Nomic games. If you're a new player, this\nis another important section, since the way proposals work in this\nNomic is a little bit complicated."},"Rules & Regulations":{"name":"Rules & Regulations","description":"Ah, yes. What would any game be without rules? And these rules\ndescribe how rules work. This section also describes the governance\nof the Rulekeepor."},"Voting":{"name":"Voting","description":"Voting is used primarily for Proposals and Elections. This section\ndescribes Agoran Decisions and how to resolve them."},"Offices & Reporting":{"name":"Offices & Reporting","description":"Players who hold offices have control over and track various\ndifferent mechanics. These rules govern the special\nresponsibilities that officers have."},"Documents":{"name":"Documents","description":"Documents are little bits of text that can be ratified, therefore\nmodifying the gamestate slightly."},"Justice":{"name":"Justice","description":"So you've broken a rule. Now what? This section describes Blots, the\nmain method of punishment for Agorans."},"Calls for Judgement":{"name":"Calls for Judgement","description":"What if there is a rule conflict? What if we can't decide what a rule\nmeans? Well then, it's time to call a CFJ."},"Obligations & Contracts":{"name":"Obligations & Contracts","description":"Agreements, promises, treaties, whatever you call them. This section\ncontains rules which can bind players to obligations, in the form of\nPledges and Contracts."},"Assets":{"name":"Assets","description":"Assets are things players can own. This section describes how that\nworks."},"Economics":{"name":"Economics","description":"The economic landscape changes quickly in Agora. No matter what name\nwe give to them, though, they all function similarly. This section\nonly describes the core mechanics. Any other economic subsystems are\ndescribed elsewhere."},"Agoriculture":{"name":"Agoriculture","description":"Every good economy has trade, and we have it in boatloads here.\nThese crops will make us rich, and we'll finally put Agora on\na map. (Maybe not the map, but a map.)"},"Numbers, and Cards Thereof":{"name":"Numbers, and Cards Thereof","description":"Distinct denominations dominate desperate, dedicated deck-builders\nduring this delightful distribution diversion."},"Victory":{"name":"Victory","description":"All games have winners, and Agora is no exception. If you're\ninterested in getting some serious bragging points among the Agorans,\nthis is the right place to look."},"Awards":{"name":"Awards","description":"Even if it's not a win, there are still a good few opportunities to\nwin bragging points, like Ribbons and Patent Titles."},"Leaders":{"name":"Leaders","description":"Agora has a good few leaders, most of which are nothing more than\nsinecures. This section isn't all that important."},"Agoran Culture":{"name":"Agoran Culture","description":"Nothing in here is all that important. Mostly describes holidays and\ntournaments, and joke rules."}},"enacted_rule_categories":{"The Game of Agora":["101","1698"],"Players":["869","478","2139","1789","2646","2678","2679"],"General Definitions":["2152","2509","2125","1023","1728","2124","2518","2505","2681"],"Entities":["1586","2162","1688","2140"],"Proposals":["2350","2625","2606","1607","2137","106"],"Rules & Regulations":["2141","217","1030","2240","105","2493","2486","1051","1681","2221","2429","2614"],"Voting":["693","107","2528","683","208","955","879","2422","2127","2168","1950","2034"],"Offices & Reporting":["1006","2630","2651","2154","2573","2160","2689","2691","2138","2472","2143","2677","2667","2632","2603","2379","2698","2616","417"],"Documents":["1551","2202","2201"],"Justice":["2555","2556","2478","2676","2531"],"Calls for Judgement":["991","591","911","2175","2492","2246"],"Obligations & Contracts":["2471","2450","2466","2618","2519","1742","2608"],"Assets":["2166","2576","2577","2578","2579"],"Economics":["2659","2701","2499","2585","2690","2699","2656"],"Agoriculture":["2704","2705","2706","2707","2708","2709","2710","2711"],"Numbers, and Cards Thereof":["2712","2713","2714"],"Victory":["2449","2465","2553"],"Awards":["2438","2480","2481","649","2415","1367","2231","2581","2582"],"Leaders":["103","104","2423","2463","2451","2575"],"Agoran Culture":["2327","2686","1727","2464","2566","2495","1769","2029","2694","2683","2695","2702","2703"]}}